---
permalink: /artikel/306
---

<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" xml:lang="sv" lang="sv">
	<head>
		<title>Fjeldstad.se - En hel massa artiklar, helt enkelt</title>
		<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1"/>
		<meta name="author" content="Anders Fjeldstad et al."/>
		<link rel="stylesheet" href="/fjeldstad.css" type="text/css"/>
		<link rel="shortcut icon" href="/bilder/favicon.ico" type="image/favicon"/>
		<script type="text/javascript" src="/fjeldstad.js"></script>
			</head>
	<body>
		<div id="box">
			<div id="box_uppe"></div>
			<div id="box_mitten">
				<div id="navigering">
					<!-- Det a-element som är aktivt ska ha id 'navigering_aktiv' -->
					<a  href="/start"><img src="/bilder/design/start_inaktiv.jpg" alt="Start"/></a>
					<a href="/artikelarkiv"><img src="/bilder/design/artikelarkiv_inaktiv.jpg" alt="Artikelarkiv"/></a>
					<a href="/forfattare"><img src="/bilder/design/forfattare_inaktiv.jpg" alt="Författare"/></a>
					<a href="/om"><img src="/bilder/design/omfjeldstadse_inaktiv.jpg" alt="Om Fjeldstad.se"/></a>
					<a href="/kontakt"><img src="/bilder/design/kontakt_inaktiv.jpg" alt="Kontakt"/></a>
					<a href="/skriv"><img src="/bilder/design/skriv_inaktiv.jpg" alt="Skriv!"/></a>
				</div>
				<div id="arbetsyta">
					<div id="vansterspalt">
		<div id="artikel-bilder">
		<img src="http://gamla.fjeldstad.se/dropshadow.php?image=bilder/titelbilder/306.jpg" alt="Experiment med WYSIWYG-editor"/>
	</div>
	
		<h3>Externa länkar</h3>
	<ul>
				<li><a href="http://tinymce.moxiecode.com/" title="TinyMCE">TinyMCE</a></li>
			</ul>
	
		<h3>Relaterade artiklar</h3>
	<ul>
				<li><a href="/artikel/286" title="Nya Fjeldstad.se är här!">Nya Fjeldstad.se &auml;r h&auml;r!</a></li>
				<li><a href="/artikel/84" title="Att bygga en blog">Att bygga en blog</a></li>
			</ul>
	
		<h3>Läsarnas kommentarer</h3>
	<ul id="kommentarlista">
				<li><span>1. Samuel Sj&ouml;berg <span>28 september 2005</span></span><div class="avdelare"></div><p>Inv&auml;ntar reaktionerna med sp&auml;nning eftersom jag t&auml;nkt anv&auml;nda detta bibliotek i mitt projekt. N&auml;r jag experimenterat &auml;r det bilder som ibland hamnat lite lustigt runt paragraferna, men f&ouml;rhoppningsvis ska det inte bli n&aring;got problem i skarpt l&auml;ge (om inte anv&auml;ndarna misshandlar editorn precis som jag).</p></li>
				<li><span>2. Ringo <span>28 september 2005</span></span><div class="avdelare"></div><p>Ingen Opera? Tr&aring;kigt.</p></li>
				<li><span>3. Anders <span>28 september 2005</span></span><div class="avdelare"></div><p>Samuel, det d&auml;r med bilder, hur placeras de egentligen? Det var s&aring; l&auml;nge sedan jag INTE floatade bilder, s&aring; jag minns inte riktigt... Fl&ouml;dar texten runt om eller blir det meck med att texten l&auml;ggs i ena kanten bara typ?</p></li>
				<li><span>4. Anders <span>28 september 2005</span></span><div class="avdelare"></div><p>Jag h&aring;ller med om att det &auml;r tr&aring;kigt att Opera inte kan hantera TinyMCE (eller tv&auml;rt om), s&auml;rskilt nu n&auml;r Opera blivit gratis. Ska man vara litet krass &auml;r det ju dock s&aring; att Opera inte har en j&auml;ttestor marknadsandel. Fast jag &auml;r inte s&auml;ker p&aring; att man ska vara krass. Jag &auml;r helst inte det. Vi f&aring;r h&aring;lla tummarna f&ouml;r att Operag&auml;nget implementerar den funktionalitet som kr&auml;vs, f&ouml;r annars finns det &ouml;verhuvudtaget ingen m&ouml;jlighet till RichText-textf&auml;lt i l&auml;saren.</p></li>
				<li><span>5. Samuel Sj&ouml;berg <span>29 september 2005</span></span><div class="avdelare"></div><p>Det kan vara v&auml;rt att p&aring;peka att tinyMCE b&ouml;r degradera fint om richText inte st&ouml;ds. Jag har inte testat detta, men jag f&ouml;ruts&auml;tter det. Ang&aring;ende bilder s&aring; placeras de precis s&aring; som man vill, man kan allts&aring; v&auml;lja att floata dem, eller l&auml;gga den som inline-object (vill jag minnas).</p></li>
				<li><span>6. Anders <span>29 september 2005</span></span><div class="avdelare"></div><p>Samuel, det st&auml;mmer att det degraderar p&aring; ett bra s&auml;tt - om det inte st&ouml;ds s&aring; ser man en vanlig textarea ist&auml;llet, helt enkelt. Dock f&aring;r man t&auml;nka p&aring; att all HTML-kod ocks&aring; visas i det fallet, s&aring; d&aring; f&aring;r man fixa n&aring;gon slags l&ouml;sning f&ouml;r att rensa upp litet innan inneh&aring;llet presenteras f&ouml;r anv&auml;ndaren. Detta &auml;r inte n&aring;got jag hunnit ordna p&aring; Fjeldstad.se, men helt klart en m&aring;ls&auml;ttning.</p></li>
			</ul>
	
	

</div>
<div id="hogerspalt" style="margin-bottom: 0px;">
	<div id="artikel">
		<h1>Experiment med WYSIWYG-editor</h1>
		<div class="ingress">
			<p>Jag har under en tid kikat litet p&aring; en WYSIWYG-editor som helt bygger p&aring; Javascript. Nu kan jag inte h&aring;lla mig l&auml;ngre, och d&auml;rf&ouml;r har jag integrerat den med f&ouml;rfattarl&auml;get p&aring; Fjeldstad.se.</p>		</div>
		<div>
			<p><a href="http://tinymce.moxiecode.com/" target="_self">TinyMCE</a> &auml;r ett Javascriptbibliotek utvecklat av <a href="http://www.moxiecode.com/" target="_self">Moxiecode Systems</a> som erbjuder funktionalitet f&ouml;r att ers&auml;tta vanliga textf&auml;lt med RichText-f&auml;lt, allts&aring; textf&auml;lt med formateringsm&ouml;jligheter. I praktiken inneb&auml;r detta att man inte beh&ouml;ver kunna n&aring;gon HTML f&ouml;r att skriva snygga, formaterade texter.</p><p>Jag har best&auml;mt mig f&ouml;r att anv&auml;nda TinyMCE p&aring; Fjeldstad.se, &aring;tminstone som ett experiment. Framf&ouml;rallt beror detta p&aring; att jag vill testa tekniken f&ouml;r att se om jag kan anv&auml;nda den i andra sammanhang, men jag vill f&ouml;rst&aring;s &auml;ven g&ouml;ra formateringsm&ouml;jligheterna tillg&auml;ngliga &auml;ven f&ouml;r f&ouml;rfattare som inte kan HTML (och inte vill l&auml;ra sig).</p><p>Det ska n&auml;mnas att denna f&ouml;r&auml;ndring troligen inte kommer att uppskattas av alla f&ouml;rfattare. Det finns n&auml;mligen n&aring;gra nackdelar:</p> <ul>   <li>TinyMCE fungerar &ouml;verhuvudtaget inte i Opera, eftersom Opera inte implementerar det bibliotek som anv&auml;nds.</li>   <li>Kompabiliteten med Safari &auml;r &auml;nnu inte hundraprocentig, enligt utvecklarna av TinyMCE.</li>   <li>TinyMCE &auml;r ett ganska stort bibliotek, och kan d&auml;rf&ouml;r medf&ouml;ra laddningstider som &auml;r n&aring;got l&auml;ngre &auml;n normalt.</li>   <li>I den aktuella versionen av TinyMCE finns inte st&ouml;d f&ouml;r alla typer av blockelement. Som exempel finns inte blockquote och code, n&aring;got som jag sj&auml;lv st&ouml;r mig litet p&aring;.</li>   <li>Editorn anv&auml;nder popup-f&ouml;nster till vissa funktioner.<br />   </li>   <li>TinyMCE &auml;r inte helt buggfritt. Utvecklingen p&aring;g&aring;r dock.<br />   </li> </ul> <p>&Auml;ven om detta l&aring;ter negativt s&aring; tror jag att f&ouml;rdelarna kommer att v&auml;ga tyngre. Det blir l&auml;ttare att g&ouml;ra de vanligaste formateringarna. Koden som genereras validerar enligt XHTML 1.0 Strict. Det blir enkelt att direkt se hur ens artikel ser ut, n&aring;got som varit en nackdel med Fjeldstad.se:s system hittills. Bes&ouml;karna (som inte &auml;r f&ouml;rfattare) kommer inte att m&auml;rka n&aring;gon skillnad alls.<br /> </p><p>Det &auml;r m&ouml;jligt att vissa artiklar ser litet lustiga ut p&aring; grund av eventuella problem i den konvertering jag genomf&ouml;rt i samband med att jag lade in TinyMCE. Jag tror inte att det f&ouml;rekommer, men jag s&auml;ger det &auml;nd&aring; f&ouml;r att vara p&aring; den s&auml;kra sidan.</p><p>Detta &auml;r allts&aring; ett experiment, och jag &auml;r mycket &ouml;ppen f&ouml;r kommentarer och synpunkter!&nbsp;</p>		</div>
		<div id="signatur">
						<a href="/forfattare/1"><img src="/bilder/forfattarbilder/1.jpg" alt="Anders Fjeldstad"/></a>
						<p style="padding-top: 60px;">
				<a href="/forfattare/1">Anders Fjeldstad</a><br/>
				Publicerad 28 september 2005			</p>
			<div class="clear"></div>
		</div>
	</div>
</div>
					<div style="clear: both;"></div>
				</div>
				<div id="sidfot">
					<p>Copyright &copy; 2005 <a href="/forfattare">Anders Fjeldstad et al.</a></p>
				</div>
			</div>
			<div id="box_nere"></div>
		</div>
		<script src="http://www.google-analytics.com/urchin.js" type="text/javascript"></script>
		<script type="text/javascript">
			_uacct = "UA-342048-1";
			urchinTracker();
		</script>
	</body>
</html>
