---
permalink: /artikel/312/index.html
---

<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" xml:lang="sv" lang="sv">
	<head>
		<title>Fjeldstad.se - En hel massa artiklar, helt enkelt</title>
		<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1"/>
		<meta name="author" content="Anders Fjeldstad et al."/>
		<link rel="stylesheet" href="/fjeldstad.css" type="text/css"/>
		<link rel="shortcut icon" href="/bilder/favicon.ico" type="image/favicon"/>
		<script type="text/javascript" src="/fjeldstad.js"></script>
			<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
  ga('create', 'UA-342048-12', 'fjeldstad.se');
  ga('send', 'pageview');
</script>
</head>
	<body>
		<div id="box">
			<div id="box_uppe"></div>
			<div id="box_mitten">
				<div id="navigering">
					<!-- Det a-element som är aktivt ska ha id 'navigering_aktiv' -->
					<a  href="/start"><img src="/bilder/design/start_inaktiv.jpg" alt="Start"/></a>
					<a href="/artikelarkiv"><img src="/bilder/design/artikelarkiv_inaktiv.jpg" alt="Artikelarkiv"/></a>
					<a href="/forfattare"><img src="/bilder/design/forfattare_inaktiv.jpg" alt="Författare"/></a>
					<a href="/om"><img src="/bilder/design/omfjeldstadse_inaktiv.jpg" alt="Om Fjeldstad.se"/></a>
					<a href="/kontakt"><img src="/bilder/design/kontakt_inaktiv.jpg" alt="Kontakt"/></a>
					<a href="/skriv"><img src="/bilder/design/skriv_inaktiv.jpg" alt="Skriv!"/></a>
				</div>
				<div id="arbetsyta">
					<div id="vansterspalt">
		<div id="artikel-bilder">
		<img class="dropshadow" src="/bilder/titelbilder/312.jpg" alt="Om VR, del 1: Introduktion"/>
	</div>
	
	
		<h3>Relaterade artiklar</h3>
	<ul>
				<li><a href="/artikel/347" title="Modellering och animering">Modellering och animering</a></li>
				<li><a href="/artikel/342" title="Kollektiv utbildning. Varför inte?">Kollektiv utbildning. Varf&ouml;r inte?</a></li>
				<li><a href="/artikel/323" title="Vetenskaplig visualisering">Vetenskaplig visualisering</a></li>
				<li><a href="/artikel/314" title="Om VR, del 5: Interaktion">Om VR, del 5: Interaktion</a></li>
				<li><a href="/artikel/315" title="Om VR, del 4: Haptisk återkoppling">Om VR, del 4: Haptisk &aring;terkoppling</a></li>
				<li><a href="/artikel/316" title="Om VR, del 3: Tracking">Om VR, del 3: Tracking</a></li>
				<li><a href="/artikel/313" title="Om VR, del 2: Bildskärmsteknik">Om VR, del 2: Bildsk&auml;rmsteknik</a></li>
			</ul>
	
		<h3>Läsarnas kommentarer</h3>
	<ul id="kommentarlista">
				<li><span>1. Finland <span>13 oktober 2005</span></span><div class="avdelare"></div><p>Hur m&aring;nga delar blir det?</p></li>
				<li><span>2. Anders <span>13 oktober 2005</span></span><div class="avdelare"></div><p>Jag hade t&auml;nkt mig tre stycken till att b&ouml;rja med. Nummer tv&aring; handlar om bildsk&auml;rmar f&ouml;r VR-till&auml;mpningar (eller allm&auml;nt om &quot;display&quot;-tekniker) och del tre behandlar interaktion i VR-milj&ouml;er. Sedan f&aring;r jag se om det &auml;r n&aring;got intressant som fattas. Kom g&auml;rna med f&ouml;rslag!</p></li>
				<li><span>3. Anders <span>13 oktober 2005</span></span><div class="avdelare"></div><p>F&ouml;rresten, det kommer bli en del om haptisk &aring;terkoppling ocks&aring;.</p></li>
				<li><span>4. Peter <span>14 oktober 2005</span></span><div class="avdelare"></div><p>Vilken o&auml;ndligt ful bild du har lagt upp. Du borde inte f&ouml;rst&ouml;ra hemsidor p&aring; det s&auml;ttet.</p></li>
			</ul>
	
	

</div>
<div id="hogerspalt" style="margin-bottom: 0px;">
	<div id="artikel">
		<h1>Om VR, del 1: Introduktion</h1>
		<div class="ingress">
			<p>VR &ndash; virtuell verklighet allts&aring; &ndash; &auml;r ett v&auml;ldigt stort och f&ouml;r de flesta ok&auml;nt omr&aring;de. Min plan &auml;r att i n&aring;gra korta artiklar f&ouml;s&ouml;ka f&ouml;rklara vad VR handlar om, hur det ser ut idag, vad det kan t&auml;nkas anv&auml;ndas till och litet om specifika tekniker inom omr&aring;det. Jag skriver detta prim&auml;rt f&ouml;r att sammanfatta f&ouml;r mig sj&auml;lv vad jag l&auml;rt mig i kursen TNM053 VR-teknik som jag l&auml;st nu under h&ouml;sten, men jag hoppas att &auml;ven andra kan tycka att det &auml;r litet intressant att l&auml;sa om det.</p><p>F&ouml;rst av allt: en liten introduktion!&nbsp;</p>		</div>
		<div>
			<p>VR, eller virtuell verklighet, &auml;r ett f&ouml;r m&aring;nga luddigt begrepp. Jag tror att m&aring;nga med mig direkt associerar till stora hj&auml;lmar med en massa sladdar som n&aring;gon stackare g&aring;r omkring med p&aring; skallen och g&ouml;r n&aring;got som f&ouml;r omv&auml;rlden kan tyckas b&aring;de lustigt och meningsl&ouml;st p&aring; samma g&aring;ng. Detta kan visserligen vara sant i vissa fall, men det beh&ouml;ver det inte vara och det &auml;r definitivt inte syftet med VR.</p><p><strong>I m&aring;ngt och mycket</strong> anser jag att det f&ouml;rsta st&ouml;rre delm&aring;let med att utveckla virtuell verklighet &auml;r att l&aring;ta anv&auml;ndaren bryta sig fri fr&aring;n skrivbordsmetaforen med alla dess begr&auml;nsningar. Jag talar allts&aring; om gr&auml;nssnitt samt interaktions- och presentationstekniker inom datorprogram h&auml;r. Vi &auml;r vana vid att sitta med v&aring;rt &quot;skrivbord&quot; fullt med ikoner och papperskorg och hela kalaset, att klicka med musen och skriva p&aring; tangentbordet. Sj&auml;lvklart, eller hur?</p><p>I vissa fall passar ju skrivbordsliknelsen j&auml;ttebra. N&auml;r man jobbar med ordbehandling eller kanske layout av en trycksak &auml;r det inte helt fel att ha en plan arbetsyta att disponera. Det beh&ouml;ver inte k&auml;nnas som en begr&auml;nsning utan snarare naturligt &ndash; hade vi inte haft datorn s&aring; hade vi ju suttit vid n&aring;got slags skrivbord och jobbat &auml;nd&aring;.</p><p>Men det finns ju s&aring; m&aring;nga andra typer av nytto- och n&ouml;jesprogram som man k&ouml;r p&aring; sin dator d&auml;r det inte alls &auml;r smidigt att ha en platt arbetsyta som man styr med mus och tangentbord! Ett sj&auml;lvklart exempel &auml;r f&ouml;rst&aring;s alla typer av till&auml;mpningar d&auml;r man vill visa upp n&aring;got i 3D, eller &aring;tminstone p&aring; ett s&auml;tt som <em>ser ut</em> att vara 3D. De flesta moderna spel &auml;r s&aring;dana program, men det finns f&ouml;rst&aring;s m&aring;nga andra (mer nyttobetonade) applikationer som hamnar i samma situation. Alla typer av visualiseringar och simuleringar av verkliga scener till exempel, eller varf&ouml;r inte st&ouml;dprogram inom kirurgi och modelleringsmilj&ouml;er vid farkostdesign?</p><p><strong>Vad jag f&ouml;rs&ouml;ker s&auml;ga</strong> &auml;r att man nog inte ska ta skrivbordsmetaforen som det sj&auml;lvklara gr&auml;nssnittet i alla l&auml;gen, &auml;ven om det r&aring;kar vara vad vi &auml;r mest vana vid. F&ouml;r att dra en liten parallell till alla sorters kreativa processer s&aring; vill jag p&aring;peka att det &auml;r v&auml;ldigt l&auml;tt att fastna vid den f&ouml;rsta l&ouml;sningen man kommer p&aring; &ndash; &auml;ven om det ofta lurar b&auml;ttre id&eacute;er bakom knuten f&ouml;r den som &auml;r ih&auml;rdig. Jag anser att &auml;ven gr&auml;nssnittsdesign ska ses som ett skapande d&auml;r man har fler faktorer att t&auml;nka p&aring; &auml;n typ hur knappar och textf&auml;lt ska se ut...</p><p>T&auml;nk p&aring; den stackare som sitter p&aring; Volvo och ska designa en schysst bild&ouml;rr som st&auml;ngs med r&auml;tt k&auml;nsla och ett lyxigt, robust ljud. Hur g&ouml;ra? Okej, jag vet inte hur det g&aring;r till i verkligheten, men jag skulle kunna tro att man bygger modeller och prototyper, justerar och modifierar, g&aring;r tillbaka till ritbordet, bygger igen, testar och s&aring; vidare. En iterativ process d&auml;r man s&auml;kert anv&auml;nder datorst&ouml;d f&ouml;r att generera CAD-modeller och annat, f&ouml;r att sedan l&aring;ta en annan avdelning ta fram den fysiska modellen som man sedan kan prova och utv&auml;rdera.</p><p>T&auml;nk om designern ist&auml;llet kunde stiga in i en virtuell formgivningsmilj&ouml; d&auml;r alla parametrar kunde justeras och testas utan n&aring;gra dyra och tidskr&auml;vande mellansteg! Man g&aring;r fram till modellen, k&auml;nner p&aring; den med h&auml;nderna, lyssnar p&aring; ljudet n&auml;r d&ouml;rren st&auml;ngs och &ouml;ppnas, k&auml;nner p&aring; vikten... Detta &auml;r ju precis vad man vill g&ouml;ra! Att kunna se, k&auml;nna och h&ouml;ra simuleringen av n&aring;got man skapat i sin fantasi. Detta &auml;r vad VR vill &aring;stadkomma. Visst &auml;r det en l&aring;ng v&auml;g kvar tills alla delar fungerar bra tillsammans, men utvecklingen g&aring;r faktiskt fram&aring;t och allt m&aring;ste ju b&ouml;rja med en vision, eller hur?<br /> </p><p><strong>Jag hoppas</strong> att jag med den h&auml;r korta introduktionen har f&ouml;rklarat litet om vad jag sj&auml;lv tycker &auml;r de prim&auml;ra problem som skulle kunna l&ouml;sas med hj&auml;lp av VR. Virtuell verklighet &auml;r enligt mig, likt m&aring;nga andra teknikintensiva omr&aring;den, inget sj&auml;lv&auml;ndam&aring;l, utan b&ouml;r ist&auml;llet anv&auml;ndas f&ouml;r att l&ouml;sa invecklade visualiserings- och interaktionsproblem p&aring; innovativa s&auml;tt. Klyschigt uttryckt kanske, men jag tycker faktiskt att det ligger till p&aring; det h&auml;r s&auml;ttet, och jag tror faktiskt att utvecklingen har g&aring;tt fr&aring;n att vara &quot;en h&auml;ftig hj&auml;lm&quot;, typ, till att fokusera mer p&aring; m&ouml;jliga till&auml;mpningar med anv&auml;ndaren i centrum. Bra grejer allts&aring;.<br /> </p>		</div>
		<div id="signatur">
						<a href="/forfattare/1"><img src="/bilder/forfattarbilder/1.jpg" alt="Anders Fjeldstad"/></a>
						<p style="padding-top: 60px;">
				<a href="/forfattare/1">Anders Fjeldstad</a><br/>
				Publicerad 13 oktober 2005			</p>
			<div class="clear"></div>
		</div>
	</div>
</div>
					<div style="clear: both;"></div>
				</div>
				<div id="sidfot">
					<p>Copyright &copy; 2005 <a href="/forfattare">Anders Fjeldstad et al.</a></p>
				</div>
			</div>
			<div id="box_nere"></div>
		</div>
		
	</body>
</html>
