---
permalink: /artikel/313/index.html
---

<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" xml:lang="sv" lang="sv">
	<head>
		<title>Fjeldstad.se - En hel massa artiklar, helt enkelt</title>
		<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1"/>
		<meta name="author" content="Anders Fjeldstad et al."/>
		<link rel="stylesheet" href="/fjeldstad.css" type="text/css"/>
		<link rel="shortcut icon" href="/bilder/favicon.ico" type="image/favicon"/>
		<script type="text/javascript" src="/fjeldstad.js"></script>
			<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
  ga('create', 'UA-342048-12', 'fjeldstad.se');
  ga('send', 'pageview');
</script>
</head>
	<body>
		<div id="box">
			<div id="box_uppe"></div>
			<div id="box_mitten">
				<div id="navigering">
					<!-- Det a-element som är aktivt ska ha id 'navigering_aktiv' -->
					<a  href="/start"><img src="/bilder/design/start_inaktiv.jpg" alt="Start"/></a>
					<a href="/artikelarkiv"><img src="/bilder/design/artikelarkiv_inaktiv.jpg" alt="Artikelarkiv"/></a>
					<a href="/forfattare"><img src="/bilder/design/forfattare_inaktiv.jpg" alt="Författare"/></a>
					<a href="/om"><img src="/bilder/design/omfjeldstadse_inaktiv.jpg" alt="Om Fjeldstad.se"/></a>
					<a href="/kontakt"><img src="/bilder/design/kontakt_inaktiv.jpg" alt="Kontakt"/></a>
					<a href="/skriv"><img src="/bilder/design/skriv_inaktiv.jpg" alt="Skriv!"/></a>
				</div>
				<div id="arbetsyta">
					<div id="vansterspalt">
		<div style="margin-top: 30px;"></div>
	
	
		<h3>Relaterade artiklar</h3>
	<ul>
				<li><a href="/artikel/342" title="Kollektiv utbildning. Varför inte?">Kollektiv utbildning. Varf&ouml;r inte?</a></li>
				<li><a href="/artikel/323" title="Vetenskaplig visualisering">Vetenskaplig visualisering</a></li>
				<li><a href="/artikel/314" title="Om VR, del 5: Interaktion">Om VR, del 5: Interaktion</a></li>
				<li><a href="/artikel/315" title="Om VR, del 4: Haptisk återkoppling">Om VR, del 4: Haptisk &aring;terkoppling</a></li>
				<li><a href="/artikel/316" title="Om VR, del 3: Tracking">Om VR, del 3: Tracking</a></li>
				<li><a href="/artikel/312" title="Om VR, del 1: Introduktion">Om VR, del 1: Introduktion</a></li>
			</ul>
	
		<h3>Läsarnas kommentarer</h3>
	<ul id="kommentarlista">
				<li><span>1. Korrekturtrollet <span>16 oktober 2005</span></span><div class="avdelare"></div><p>&quot;I stora drag &aring;terskapas ljusv&aring;gfronter f&ouml;r virtuella objekt i en (kraftfull) dator, f&ouml;r att sedan kan projiceras ut framf&ouml;r betraktaren&quot;
-Tryckfelsnisse har varit framme</p></li>
				<li><span>2. Peter <span>16 oktober 2005</span></span><div class="avdelare"></div><p>Det g&aring;r ju &auml;ven att n&auml;mna att ljudet ekar otroligt mycket i en CAVE, med tanke p&aring; att v&auml;ggarna &auml;r gjorda av glas. Jag kom f&ouml;rresten att t&auml;nka p&aring; en sak, det &auml;r intressant att du anv&auml;nder serifer som rubriker och linj&auml;rer i br&ouml;dtext. Tv&auml;rt om vad som &auml;r &quot;normalt&quot; allts&aring;. Jag antar att detta beror p&aring; att linj&auml;rer &auml;r l&auml;ttare att l&auml;sa p&aring; bildsk&auml;rmar, samtidigt som problemet med serifer f&ouml;rsvinner allt eftersom typsnittet blir st&ouml;rre?</p></li>
				<li><span>3. Anders <span>16 oktober 2005</span></span><div class="avdelare"></div><p>Precis, Peter. P&aring; bildsk&auml;rmar &auml;r det vedertaget l&auml;ttare att l&auml;sa linj&auml;rer. Serifer anv&auml;nder jag i rubrikerna just f&ouml;r att det ska bli litet variation.</p></li>
				<li><span>4. Peter <span>16 oktober 2005</span></span><div class="avdelare"></div><p>Det leder oavkortat in mig p&aring; en annan sak. Du skrev just &quot;litet variation&quot;, n&aring;got som jag inte f&ouml;rst&aring;r mig p&aring; i dagens vardagsspr&aring;k. Jag har sedan barnsben l&auml;rt mig &quot;lite variation&quot;, &quot;lite gr&ouml;t&quot; och &quot;lite ledsen&quot;. Varf&ouml;r har det p&aring; senare &aring;r blivit inne att skriva &quot;litet&quot;?</p></li>
				<li><span>5. Anders <span>17 oktober 2005</span></span><div class="avdelare"></div><p>Hm intressant fr&aring;ga. Jag har tagit f&ouml;r vana att alltid skriva &quot;litet&quot;, men nu var jag ju tvungen att kolla upp det. Enligt Svenska spr&aring;kn&auml;mnden ska &quot;litet&quot; anv&auml;ndas i till exempel &quot;ett litet hus&quot; medan &quot;lite&quot; &auml;r normalt att nyttja i till exempel &quot;sova f&ouml;r lite&quot;. Det verkar dock inte vara n&aring;gra strikta regler.</p></li>
				<li><span>6. Peter <span>17 oktober 2005</span></span><div class="avdelare"></div><p>Ja det var s&aring; jag ocks&aring; tyckte att det var. F&ouml;r mig &auml;r det tv&aring; helt skilda ord.</p></li>
				<li><span>7. Finland <span>18 oktober 2005</span></span><div class="avdelare"></div><p>Peter, du kanske vill skriva din egen VR-sammanfattning?!</p></li>
				<li><span>8. Jesper <span>19 oktober 2005</span></span><div class="avdelare"></div><p>Hahah gillar er disskusion om lite och litet. Jag skulle st&auml;lla mig bakom Peters s&auml;tt att se p&aring; det. En annan detalj som fick mig att skratta lite, (inte litet), under denna dysta pluggning till muntan, (&auml;ven om texten du skrivit h&auml;r Anders &auml;r mycket trevligare att l&auml;sa &auml;n en del av de ofantligt m&aring;nga artiklarna), var ditt nya uttryck &quot;fladderfrekvensen&quot;.
Bra jobbat! Nu ska jag g&aring; vidare och l&auml;sa de andra artiklarna.</p></li>
				<li><span>9. Anders <span>19 oktober 2005</span></span><div class="avdelare"></div><p>Hehe, tackar tackar...</p></li>
			</ul>
	
	

</div>
<div id="hogerspalt" style="margin-bottom: 0px;">
	<div id="artikel">
		<h1>Om VR, del 2: Bildsk&auml;rmsteknik</h1>
		<div class="ingress">
			<p>Det finns en m&auml;ngd olika typer av apparater f&ouml;r visualisering av VR-milj&ouml;er, allt fr&aring;n vanliga bildsk&auml;rmar med stereoeffekt till m&auml;rkliga halvmekaniska l&ouml;sningar. I den h&auml;r artikeln t&auml;nkte jag g&aring; igenom n&aring;gra av dem, f&ouml;r att f&ouml;rs&ouml;ka ge en god &ouml;verblick.</p>		</div>
		<div>
			<p>Egentligen &auml;r titeln &quot;bildsk&auml;rmsteknik&quot; litet missvisande, eftersom VR-milj&ouml;er visualiseras p&aring; m&aring;nga olika s&auml;tt d&auml;r traditionella bildsk&auml;rmar inte alltid &auml;r inblandade. &Aring; andra sidan kom jag inte p&aring; n&aring;gon b&auml;ttre titel, och jag tror nog att man f&ouml;rst&aring;r vad det handlar om.</p> <p><strong>Vad &auml;r det d&aring;</strong> som kr&auml;vs av en VR-bildsk&auml;rm? Hela id&eacute;n &auml;r ju att man ska kunna uppleva en p&aring;hittad milj&ouml; som i n&aring;gon mening ska k&auml;nnas <em>verklig</em>. Detta inneb&auml;r att den &quot;bildsk&auml;rm&quot; man anv&auml;nder m&aring;ste kunna &aring;terskapa den virtuella modellen av milj&ouml;n p&aring; ett &ouml;vertygande s&auml;tt, vilket implicerar att den ska f&ouml;refalla att vara lika tredimensionell som den verkliga v&auml;rlden. Detta &auml;r allts&aring; grundkriteriet, enligt min tolkning.</p> <h3>Stereoskopi&nbsp;</h3> <p>Datorprogram som visar &quot;3D-grafik&quot; har ju funnits l&auml;nge, och vi anv&auml;nder v&aring;ra vanliga bildsk&auml;rmar f&ouml;r att titta p&aring; dem. Vad &auml;r d&aring; problemet? Jo, &auml;ven om m&auml;nniskans hj&auml;rna &auml;r bra p&aring; att tolka 2D-projektioner av 3D-objekt som i n&aring;gon m&aring;n tredimensionella, s&aring; erbjuder &quot;standard-3D-grafik&quot; p&aring; vanliga bildsk&auml;rmar inte en &quot;&auml;kta&quot; tredimensionell bild. Till exempel finns det inget riktigt djup i bilden, och vi kan inte titta runt h&ouml;rn genom att flytta p&aring; huvudet.<br /> <br />  F&ouml;r att komma ett steg n&auml;rmare riktig 3D kan man introducera <em>stereoskopiska</em> visningstekniker. Dessa bygger p&aring; att &ouml;gonen hela tiden visas varsin bild, d&auml;r man tagit h&auml;nsyn till att &ouml;gonen faktiskt ser olika bilder i verkligheten p&aring; grund av (eller snarare tack vare) att de &auml;r placerade med ett visst mellanrum. Det &auml;r denna lilla &quot;funktion&quot; som g&ouml;r att vi i normala fall har ett djupseende, och detta fungerar &auml;ven att reproducera med stereoskopisk 3D-grafik.</p><p><strong>S&auml;ttet att faktiskt presentera</strong> olika bilder f&ouml;r olika &ouml;gon varierar. En metod g&aring;r ut p&aring; att l&aring;ta varannan bildruta som visas vara f&ouml;r det v&auml;nstra &ouml;gat och varannan f&ouml;r det h&ouml;gra. Betraktaren f&aring;r ha p&aring; sig speciella glas&ouml;gon som &quot;blundar&quot; med ett &quot;&ouml;ga&quot; &aring;t g&aring;ngen, och som &auml;r synkroniserade med bildsk&auml;rmen, s&aring; att r&auml;tt &ouml;ga ser r&auml;tt bild hela tiden. Detta kallas f&ouml;r &quot;aktiv&quot; stereo. En uppenbar nackdel &auml;r f&ouml;rst&aring;s att uppdateringshastigheten halveras eftersom varje bildruta i realiteten visas dubbelt s&aring; l&auml;nge som den borde. En annan tr&aring;kighet &auml;r att man inte kan anv&auml;nda de i &ouml;vrigt trevliga LCD-monitorer som &auml;r standard f&ouml;r persondatorer idag, eftersom s&aring;dana ger ifr&aring;n sig polariserat ljus, och &quot;blundningsfunktionen&quot; i glas&ouml;gonen utnyttjar polariserande filter.<br /> </p><p>Ett annat s&auml;tt &auml;r att l&aring;ta tv&aring; projektorer med olika polarisering p&aring; ljuset belysa en projektorduk som bevarar polariseringen, och sedan utrusta betraktaren med glas&ouml;gon som visar de olika polariseringarna f&ouml;r olika &ouml;gon. Detta &auml;r k&auml;nt som &quot;passiv&quot; stereo. En trist grej h&auml;r &auml;r att det inte fungerar p&aring; en vanlig datormonitor, eftersom en s&aring;dan inte kan producera olika polariseringar p&aring; samma g&aring;ng.<br /> </p><p><strong>Det finns &auml;ven bildsk&auml;rmar</strong> med <em>autostereoskopi</em>. Med detta menas att man inte beh&ouml;ver n&aring;gon speciell utrustning f&ouml;r att f&aring; en upplevelse av djup i bilden. N&aring;gra s&auml;rskilda glas&ouml;gon kr&auml;vs till exempel inte. Det finns olika varianter av den h&auml;r tekniken ocks&aring;, men gemensamt f&ouml;r de olika &auml;r att de bara producerar ett &auml;ndligt antal m&ouml;jliga betraktningsvinklar, vilket nog kan ses som en av de st&ouml;rre nackdelarna. En f&ouml;rdel &auml;r &aring; andra sidan att vissa implementationer fungerar f&ouml;r fler betraktare samtidigt.</p> <h3>Tracking av huvudet</h3> <p>Tracking skulle man kanske kunna kalla &quot;sp&aring;rning&quot; p&aring; svenska, men jag tycker att det l&aring;ter &auml;nnu fjantigare &auml;n att beh&aring;lla det engelska ordet, s&aring; jag g&ouml;r ingen &ouml;vers&auml;ttningsman&ouml;ver denna g&aring;ng.</p> <p>&quot;Head tracking&quot;, eller kort och gott &quot;tracking av huvudet&quot; inneb&auml;r att visningssystemet p&aring; n&aring;got s&auml;tt tar h&auml;nsyn till var huvudet (och d&auml;rmed &ouml;gonen) befinner sig. I ett s&aring;dant system &auml;r det allts&aring; teoretiskt m&ouml;jligt att titta &quot;runt h&ouml;rn&quot; och p&aring; det s&auml;ttet faktiskt f&aring; en k&auml;nsla av att milj&ouml;n &auml;r tredimensionell. Det &auml;r vanligt att huvud-tracking kombineras med stereoskopi eftersom effekten blir mycket tydligare d&aring;.</p> <p>&Auml;ven inom detta omr&aring;de (tracking allm&auml;nt) s&aring; existerar en m&auml;ngd olika implementationer som angriper problemet p&aring; skilda s&auml;tt. Arrangemang med ultraljudsmikrofoner och -h&ouml;gtalare utnyttjar det faktum att ljud har en viss hastighet i luft f&ouml;r att r&auml;kna ut positionen f&ouml;r en viss punkt (som till exempel kan vara placerad p&aring; anv&auml;ndarens huvud). Andra varianter anv&auml;nder accelerometrar f&ouml;r att matematiskt ber&auml;kna position utifr&aring;n hur en sensor r&ouml;rt sig fr&aring;n sitt utg&aring;ngsl&auml;ge. &Auml;ven rent mekaniska apparater finns f&ouml;rst&aring;s ocks&aring;, och r&auml;knas till de enklare l&ouml;sningarna. Naturligtvis finns det &auml;ven implementationer som bygger p&aring; kombinationer av flera tekniker. P&aring; det s&auml;ttet kommer man runt flera av de individuella l&ouml;sningarnas nackdelar.</p><h3>&quot;Head-mounted displays&quot;</h3> <p>Okej, okej...h&auml;r kommer en till engelsk term som jag inte ids &ouml;vers&auml;tta. &quot;Head-mounted displays&quot; eller <em>HMDs</em> &auml;r allts&aring; den typ av visningsh&aring;rdvara som gemene man kanske fr&auml;mst associerar med begreppet VR. De stora och klumpiga hj&auml;lmar som vi kanske minns fr&aring;n f&ouml;r ett par &aring;r sedan &auml;r av typen HMD (som ordet indikerar). Nu f&ouml;r tiden &auml;r denna variant betydligt l&auml;ttare och smidigare, men bygger fortfarande p&aring; att man har en liten bildsk&auml;rm framf&ouml;r varje &ouml;ga, som d&auml;rigenom kan visa olika bilder och utnyttja stereoeffekten. Dessutom kombinerar man detta med tracking, s&aring; att man kan h&aring;lla reda p&aring; position och orientering av anv&auml;ndarens huvud.</p> <p>En stor nackdel med HMDs &auml;r att de ofta har f&ouml;r l&aring;ga uppdateringsfrekvenser, vilket inneb&auml;r att anv&auml;ndaren kan uppleva att den virtuella v&auml;rlden &quot;sl&auml;par efter&quot; och inte h&auml;nger med i sv&auml;ngarna. I f&ouml;rl&auml;ngningen leder detta inte s&auml;llan till illam&aring;ende och andra obehag. I &ouml;vrigt &auml;r det en smidig princip, eftersom anv&auml;ndaren kan r&ouml;ra sig f&ouml;rh&aring;llandevis fritt (f&ouml;rutsatt att tracking-systemet till&aring;ter det). J&auml;mf&ouml;r detta med att sitta och titta p&aring; en vanlig bildsk&auml;rm med stereoglas&ouml;gon &ndash; k&auml;nslan av inlevelse blir garanterat st&ouml;rre med en HMD p&aring; skallen.</p> <h3>Volymetriska visningstekniker</h3>   <p>En ganska s&auml;regen klass inom VR-bildsk&auml;rmar anv&auml;nder speciella <em>volymetriska tekniker </em>f&ouml;r att visa virtuella objekt i vad som upplevs som riktig 3D. F&ouml;r att &aring;stadkomma detta kan man till exempel projicera ljus p&aring; en mycket snabbt roterande skiva. Eftersom skivan snurrar s&aring; snabbt s&aring; ser man den inte, men d&auml;remot ser man resultatet av dess belysning &ndash; ett objekt som tycks sv&auml;va i luften. En uppenbar nackdel &auml;r f&ouml;rst&aring;s att denna typ av visualisering inte kan bilda en hel <em>omgivning, </em>men jag tycker &auml;nd&aring; att det &auml;r en sp&auml;nnande l&ouml;sning. En stor f&ouml;rdel &auml;r f&ouml;rst&aring;s att man inte beh&ouml;ver n&aring;gra speciella glas&ouml;gon f&ouml;r att titta p&aring; de genererade objekten, och dessutom g&aring;r det bra att vara flera stycken som studerar visualiseringen samtidigt fr&aring;n olika vinklar.</p>   <h3>Datorgenererade hologram</h3>   <p>En intressant approach till visning av 3D-objekt &auml;r <em>datorgenererade hologram</em>. De &auml;r idag v&aring;ldsamt dyra och anv&auml;nds d&auml;rf&ouml;r n&auml;stan inte i praktiken, men allteftersom datorh&aring;rdvara blir billigare s&aring; kanske de kan komma att bli mer tillg&auml;ngliga. I stora drag &aring;terskapas ljusv&aring;gfronter f&ouml;r virtuella objekt i en (kraftfull) dator, f&ouml;r att sedan projiceras ut framf&ouml;r betraktaren. Jag ska inte ens l&aring;tsas att jag f&ouml;rst&aring;r hur det g&aring;r till, men det verkar h&auml;ftigt i alla fall.</p> <h3>Icke-immersiva bildsk&auml;rmar</h3> <p>N&auml;r man projicerar den virtuella milj&ouml;n p&aring; en stor projektorduk eller widescreen-monitor i kombination med stereoskopi och m&ouml;jligen huvud-tracking talar man om <em>icke-immersiva </em>visningstekniker (immersiv &auml;r nog inte ett riktigt svenskt ord, men det betyder i alla fall n&aring;got i stil med &ouml;vertygande, omslutande).</p> <p>Exempel p&aring; en s&aring;dan implementation &auml;r Silicon Graphics &quot;Reality Centre&quot;, som bygger p&aring; en stor, horisontellt v&auml;lvd projektionsyta som man tittar p&aring; med aktiva stereoglas&ouml;gon. Om man vill kan man &auml;ven anv&auml;nda ett trackingsystem f&ouml;r att h&aring;lla koll p&aring; anv&auml;ndarens huvud s&aring; att grafiken kan anpassas efter dess position, men detta fungerar f&ouml;rst&aring;s bara f&ouml;r en anv&auml;ndare. Om man struntar i trackingen har man d&auml;remot en av denna typ tekniks st&ouml;rsta f&ouml;rdelar &ndash; man kan visa upp VR-milj&ouml;n f&ouml;r m&aring;nga personer samtidigt.</p> <p>En viktig faktor i system av samma slag som Reality Centre &auml;r f&ouml;rst&aring;s projektorn (eller projektorerna). Den m&aring;ste kunna uppr&auml;tth&aring;lla en tillr&auml;ckligt h&ouml;g uppdateringsfrekvens samtidigt som den ska vara ljusstark, drifts&auml;ker och till&aring;ta att man utnyttjar stereoskopi.</p> <p>En vanlig projektortyp &auml;r <strong>CRT-baserad</strong>, och innefattar vanligen tre projektorer i varje enhet; en f&ouml;r vardera r&ouml;tt, gr&ouml;nt respektive bl&aring;tt. Eftersom det handlar om en CRT s&aring; &auml;r det ett analogt system, vilket g&ouml;r att det &auml;r l&auml;tt att anpassa projektorn till v&auml;lvda projektionsytor, som ju finns med i bilden n&auml;r vi talar om Reality Centre. Man vill att bilden ska f&ouml;refalla att vara rektangul&auml;r trots att duken &auml;r v&auml;lvd. En stor nackdel med CRT-baserade projektorer &auml;r att de m&aring;ste kalibreras ofta, samt att de &auml;r relativt ljussvaga.<br /> </p> <p>N&auml;sta projektorvariant bygger ist&auml;llet p&aring; <strong>LCD-teknik</strong>. En stark lampa lyser igenom ett LCD-filter som f&auml;rgar ljuset. Denna metod resulterar i starkare ljus, n&aring;got som man g&auml;rna vill ha. D&auml;remot &auml;r det kr&aring;ngligare att anpassa projektionen till den v&auml;lvda duken, och dessutom r&ouml;r det sig om en l&auml;gre uppdateringsfrekvens, vilket &auml;r ett stort problem. Vidare producerar LCD-projektorn polariserat ljus, vilket leder till problem med stereoglas&ouml;gon.</p> <p>En relativt ny projektorteknik har utvecklats av Texas Instruments och kallas f&ouml;r <strong>DLP - Digital Light Processor</strong>. Denna anv&auml;nder en stor upps&auml;ttning mikroskopiska speglar (DMD - Digital Micromirror Device), som &quot;fladdrar&quot; med mycket h&ouml;g frekvens (tusentals Hertz) och v&auml;xlar mellan att spegla vidare ljuset mot duken och att reflektera bort det s&aring; att det inte syns. Genom att variera &quot;fladderfrekvensen&quot; kan olika intensiteter i det projicerade ljuset skapas. Ett roterande genomlysbart &quot;f&auml;rghjul&quot; anv&auml;nds f&ouml;r att producera f&auml;rgbilder.</p> <p>En stor f&ouml;rdel med DLP-tekniken &auml;r att man inte har n&aring;gra problem med uppdateringsfrekvensen, eftersom speglarna kan justeras s&aring; v&aring;ldsamt snabbt. Dessutom f&aring;r man en ljusstyrka som &ouml;vergl&auml;nser LCD-projektorernas. Vidare har man m&ouml;jlighet att anv&auml;nda polariserat ljus f&ouml;r att utnyttja stereoskopi. Fortfarande &auml;r det dock ett problem att justera projektionen efter den v&auml;lvda ytan.</p> <p>Den sista typen av projektorer som jag t&auml;nkte n&auml;mna bygger p&aring; <strong>laserteknik</strong>. F&auml;rgade laserstr&aring;lar scannar (mycket snabbt) &ouml;ver projektionsytan (som kan vara v&auml;lvd eller p&aring; annat s&auml;tt oj&auml;mn) och producerar en v&auml;ldigt ljusstark och skarp bild som kan uppdateras med h&ouml;g frekvens. Det finns dock en stor nackdel: laserprojektorer &auml;r i dagsl&auml;get ofantligt dyra.</p> <p>F&ouml;rutom &quot;VR-teatrar&quot; i stil med Reality Centre s&aring; finns det andra varianter som bygger p&aring; samma princip (projektion, stereoeffekt). En s&aring;dan &auml;r den s&aring; kallade &quot;arbetsb&auml;nken&quot;, som i princip &auml;r en stor bakprojicerad monitor. Bakprojiceringen medf&ouml;r problem med f&ouml;rluster i ljusstyrka, men i &ouml;vrigt &auml;r f&ouml;r- och nackdelarna liknande dem f&ouml;r Reality Centre.</p> <h3>CAVE-system</h3> <p>En speciell implementation av ett projektorsystem &auml;r den s&aring; kallade <em>CAVE </em>(Cave Automatic Virtual Environment) som i sin mest kompletta form best&aring;r av en cirka 3x3x3 meter stor kub med bakprojicerade v&auml;ggar, tak och golv. Anv&auml;ndaren befinner sig inuti kuben och har vanligen p&aring; sig stereoglas&ouml;gon med huvud-tracking. Sex projektorer producerar bilder p&aring; kubens alla sidor, som d&aring; syns fr&aring;n insidan. P&aring; det s&auml;ttet omsluter CAVE helt och h&aring;llet anv&auml;ndaren.</p> <p>Problem med CAVE innefattar tracking av huvudet &ndash;&nbsp; n&auml;r anv&auml;ndaren r&ouml;r huvudet f&ouml;r snabbt hinner systemet inte med, vilket uppfattas som att v&auml;rlden sl&auml;par efter. Det &auml;r &auml;ven sv&aring;rt att p&aring; n&aring;got bra s&auml;tt l&auml;gga till <em>ljud</em> i systemet. Var ska h&ouml;gtalarna placeras f&ouml;r att inte f&ouml;rst&ouml;ra den visuella upplevelsen? Dessutom kr&auml;ver CAVE en massa plats och kostar en v&auml;ldig massa pengar. Och det blir, enligt uppgift, ohyggligt varmt och kvavt inne i kuben efter en liten stunds anv&auml;ndande&hellip;</p> <p><strong>Nu tror jag</strong> att jag har tagit upp de viktigaste teknikerna och implementationerna inom VR-bildsk&auml;rmar. Detta &auml;r allts&aring; t&auml;nkt mest som en &ouml;verblick, och som synes g&aring;r jag inte in p&aring; djupet i hur teknikerna egentligen fungerar. F&ouml;rhoppningsvis har jag &auml;nd&aring; lyckats belysa de centrala problemst&auml;llningarna.&nbsp;</p>		</div>
		<div id="signatur">
						<a href="/forfattare/1"><img src="/bilder/forfattarbilder/1.jpg" alt="Anders Fjeldstad"/></a>
						<p style="padding-top: 60px;">
				<a href="/forfattare/1">Anders Fjeldstad</a><br/>
				Publicerad 15 oktober 2005, uppdaterad 18 oktober 2005			</p>
			<div class="clear"></div>
		</div>
	</div>
</div>
					<div style="clear: both;"></div>
				</div>
				<div id="sidfot">
					<p>Copyright &copy; 2005 <a href="/forfattare">Anders Fjeldstad et al.</a></p>
				</div>
			</div>
			<div id="box_nere"></div>
		</div>
		
	</body>
</html>
