---
permalink: /artikel/314/index.html
---

<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" xml:lang="sv" lang="sv">
	<head>
		<title>Fjeldstad.se - En hel massa artiklar, helt enkelt</title>
		<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1"/>
		<meta name="author" content="Anders Fjeldstad et al."/>
		<link rel="stylesheet" href="/fjeldstad.css" type="text/css"/>
		<link rel="shortcut icon" href="/bilder/favicon.ico" type="image/favicon"/>
		<script type="text/javascript" src="/fjeldstad.js"></script>
			<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
  ga('create', 'UA-342048-12', 'fjeldstad.se');
  ga('send', 'pageview');
</script>
</head>
	<body>
		<div id="box">
			<div id="box_uppe"></div>
			<div id="box_mitten">
				<div id="navigering">
					<!-- Det a-element som är aktivt ska ha id 'navigering_aktiv' -->
					<a  href="/start"><img src="/bilder/design/start_inaktiv.jpg" alt="Start"/></a>
					<a href="/artikelarkiv"><img src="/bilder/design/artikelarkiv_inaktiv.jpg" alt="Artikelarkiv"/></a>
					<a href="/forfattare"><img src="/bilder/design/forfattare_inaktiv.jpg" alt="Författare"/></a>
					<a href="/om"><img src="/bilder/design/omfjeldstadse_inaktiv.jpg" alt="Om Fjeldstad.se"/></a>
					<a href="/kontakt"><img src="/bilder/design/kontakt_inaktiv.jpg" alt="Kontakt"/></a>
					<a href="/skriv"><img src="/bilder/design/skriv_inaktiv.jpg" alt="Skriv!"/></a>
				</div>
				<div id="arbetsyta">
					<div id="vansterspalt">
		<div id="artikel-bilder">
		<img class="dropshadow" src="/bilder/titelbilder/314.jpg" alt="Om VR, del 5: Interaktion"/>
	</div>
	
	
		<h3>Relaterade artiklar</h3>
	<ul>
				<li><a href="/artikel/342" title="Kollektiv utbildning. Varför inte?">Kollektiv utbildning. Varf&ouml;r inte?</a></li>
				<li><a href="/artikel/323" title="Vetenskaplig visualisering">Vetenskaplig visualisering</a></li>
				<li><a href="/artikel/315" title="Om VR, del 4: Haptisk återkoppling">Om VR, del 4: Haptisk &aring;terkoppling</a></li>
				<li><a href="/artikel/316" title="Om VR, del 3: Tracking">Om VR, del 3: Tracking</a></li>
				<li><a href="/artikel/313" title="Om VR, del 2: Bildskärmsteknik">Om VR, del 2: Bildsk&auml;rmsteknik</a></li>
				<li><a href="/artikel/312" title="Om VR, del 1: Introduktion">Om VR, del 1: Introduktion</a></li>
			</ul>
	
	
	

</div>
<div id="hogerspalt" style="margin-bottom: 0px;">
	<div id="artikel">
		<h1>Om VR, del 5: Interaktion</h1>
		<div class="ingress">
			<p>N&auml;r man befinner sig i en virtuell milj&ouml; &auml;r det ju inget roligt om man inte kan r&ouml;ra sig runt och p&aring;verka det man ser. Hur ska detta g&aring; till? I vanliga (2D-)skrivbordsapplikationer anv&auml;nder vi typiskt mus och tangentbord f&ouml;r att kontrollera milj&ouml;n, men i en VR-v&auml;rld r&aring;der ju helt andra f&ouml;ruts&auml;ttningar. Eller?</p>		</div>
		<div>
			<p>Hur ska man navigera runt i- och interagera med en virtuell v&auml;rld? Det &auml;r naturligtvis en lika intressant som viktig fr&aring;ga. Det &auml;r v&auml;lk&auml;nt att ett datorprogram med nyttiga funktioner kan ses som v&auml;rdel&ouml;st om det inte har ett genomt&auml;nkt gr&auml;nssnitt, och samma sak g&auml;ller f&ouml;r VR-till&auml;mpningar.</p><p>En faktor som f&ouml;rsv&aring;rar diskussionen &auml;r f&ouml;rst&aring;s att &quot;&auml;kta&quot; VR-v&auml;rldar inte existerar &auml;nnu. Det finns helt enkelt inte tekniska l&ouml;sningar som g&ouml;r det m&ouml;jligt f&ouml;r anv&auml;ndaren att helt uppslukas av en konstgjord omgivning som tycks lika verklig som originalet. Om s&aring; varit fallet s&aring; hade vi ju kunnat navigera runt i den precis som vanligt.</p><p>Situationen &auml;r nu ist&auml;llet ofta att man vill kunna r&ouml;ra sig runt i VR-milj&ouml;n utan att r&ouml;ra sig s&aring; mycket i verkligheten. Till exempel har ju eventuell trackingutrustning begr&auml;nsad r&auml;ckvidd, vilket st&auml;ller direkta krav p&aring; alternativ navigering. Dessutom vill man kanske plocka upp virtuella objekt f&ouml;r att pilla p&aring; dem, eller vad det nu kan t&auml;nkas vara. Okej, vi tar och tittar p&aring; navigeringsproblemet f&ouml;rst, f&ouml;r att sedan dyka litet djupare i sj&auml;lva manipulationsbiten.</p> <h3>Navigering i virtuella v&auml;rldar</h3> <p>Grundf&ouml;ruts&auml;ttningen &auml;r allts&aring; att man inte f&aring;r r&ouml;ra f&ouml;r mycket p&aring; sin kropp rent fysiskt, men att man &auml;nd&aring; m&aring;ste kunna jazza omkring obehindrat (helst) i l&aring;tsasv&auml;rlden. Det finns f&ouml;rst&aring;s flera olika l&ouml;sningsf&ouml;rslag, och ett vanligt &auml;r konceptet <strong>att flyga</strong>. Jag vet inte om det beror p&aring; att f&ouml;rm&aring;gan att kunna flyga finnas som en dr&ouml;m hos m&aring;nga m&auml;nniskor eller om det helt enkelt &auml;r resultatet av rationellt probleml&ouml;sande, men navigering genom flykt tycks ses som en naturlig approach till problemet.</p><p>Hur ska man d&aring; styra? Det finns alla m&ouml;jliga varianter. Man kan anv&auml;nda en fysisk styrspak, ratt eller motsvarande. Man kan anv&auml;nda trackingutrustning f&ouml;r att anv&auml;nda kroppsgester (St&aring;lmannen, n&aring;gon?) f&ouml;r att kontrollera framfarten och man kan anv&auml;nda <em>virtuella </em>styrspakar och liknande. F&ouml;r att ta n&aring;gra exempel. Att justera hastighet har liknande problematik och (f&ouml;rslag p&aring;) l&ouml;sningar.</p><p>Man m&aring;ste inte flyga omkring i sin VR-v&auml;rld. Naturligtvis kan man hitta p&aring; andra varianter. Om man vet var man ska s&aring; kan datorn lika g&auml;rna r&auml;kna ut f&auml;rdv&auml;gen och &quot;k&ouml;ra&quot; en till slutm&aring;let. Eller varf&ouml;r inte krympa ner hela v&auml;rlden till kartstorlek, f&ouml;r att sedan anv&auml;nda en enkel pekning avg&ouml;ra var man dimper ned n&auml;r v&auml;rlden &aring;terf&aring;r sin fulla storlek? Eller <em>teleportering</em>, det l&aring;ter ju fr&auml;ckt!</p><p>Jag vill p&aring;st&aring; att fantasin s&auml;tter gr&auml;nserna, och kanske &auml;r det just denna frihet som g&ouml;r det s&aring; sv&aring;rt att ta fram ett bra navigeringssystem. Det &auml;r ju s&aring; l&auml;tt att fastna f&ouml;r &quot;St&aring;lmannengrejen&quot;, en uppenbar l&ouml;sning... Men &auml;r den den b&auml;sta? Jag tror inte det. Men jag ska inte klaga egentligen &ndash; jag implementerade precis en s&aring;dan variant n&auml;r jag labbade tillsammans med Peter Asplund under VR-kursen.</p><p>Virtuella v&auml;rldar &auml;r n&aring;got nytt och d&auml;rf&ouml;r helt fr&auml;mmande, trots att det &auml;r vi sj&auml;lva som skapar dem. Jag tror att mer energi, fantasi och nyt&auml;nkande m&aring;ste till f&ouml;r att f&aring; fram de riktigt geniala navigeringssystemen. Kom ut ur l&aring;dan!</p> <h3>Objektmanipulering</h3> <p>Att &quot;manipulera objekt&quot;, hur kul l&aring;ter det egentligen? Ganska n&ouml;rdigt, ganska torrt. &Aring; andra sidan beh&ouml;vs kanske inga hippa omskrivningar. Jag tror att det &auml;r sv&aring;rt att beskriva sj&auml;lva f&ouml;rfarandet kort i ord just eftersom vi inte t&auml;nker p&aring; det i v&aring;r vardag. Det ligger (f&ouml;r de flesta av oss) ingen problematik i handlingar som &quot;plocka upp glaset&quot;, &quot;&ouml;ppna d&ouml;rren&quot; eller &quot;sl&aring; p&aring; TV:n&quot;. I en virtuell v&auml;rld &auml;r f&ouml;ruts&auml;ttningarna annorlunda just eftersom alla de h&auml;r sakerna per definition <em>inte existerar</em>. Men vi kan se dem, och med en portion tekniska prylar kanske vi till och med kan k&auml;nna dem. D&aring; ska det v&auml;l inte vara s&aring; sv&aring;rt att &quot;manipulera&quot; dem?</p><p>&Auml;nd&aring; ska jag inte f&ouml;rs&ouml;ka att f&ouml;rdumma problemst&auml;llningen. I och med att till&auml;mpningsomr&aring;dena f&ouml;r VR &auml;r s&aring; skilda s&aring; kr&auml;vs olika metoder f&ouml;r interaktion. </p><p>I ett projekt som folket p&aring; <a href="http://www.nvis.itn.liu.se/index.php?language=swe" target="_self">NVIS</a> h&aring;ller p&aring; med g&auml;ller det att hantera flygplansrutter i ett flygledningsprogram. Hela Skandinavien kan vara synligt p&aring; samma g&aring;ng, med alla dess flighter. Planen m&aring;ste kunna v&auml;ljas f&ouml;r att styras om. Hur ska man g&ouml;ra? Peka och klicka? Det fungerar inte alltid. R&ouml;ststyrning &auml;r ett alternativ, g&auml;rna i kombination med n&aring;got form av handstyrt inmatningssystem.</p><p>En annan till&auml;mpning &auml;r tr&auml;ningssimuleringar inom kirurgi, d&auml;r anv&auml;ndaren l&aring;tsas operera en patient. D&auml;r kr&auml;vs precis kontroll &ouml;ver verktygen, och inmatningen m&aring;ste f&ouml;rst&aring;s ske p&aring; ett s&auml;tt som liknar det verkliga &ndash; annars vore ju tr&auml;ningen r&auml;tt v&auml;rdel&ouml;s.</p><p>L&aring;t s&auml;ga att vi har en situation d&auml;r vi vill kunna hantera objekt som finns en l&auml;ngre bit ifr&aring;n oss. Vi kan v&auml;lja dem genom att peka med en virtuell laserpenna, till exempel. Sedan d&aring;? Antag att vi vill snurra p&aring; objektet, samtidigt som vi tar en n&auml;rmare titt p&aring; det. Ska objektet under sj&auml;lva handlingen flyttas till oss, som om vi hade det i v&aring;ra h&auml;nder? D&aring; skulle vi ju kunna vrida och v&auml;nda p&aring; det hur mycket vi ville. Men hur skulle detta se ut f&ouml;r en utomst&aring;ende anv&auml;ndare som ocks&aring; befann sig i VR-v&auml;rlden?</p><p><strong>Som ni ser</strong> s&aring; finns det en hel del n&ouml;tter att kn&auml;cka n&auml;r det g&auml;ller interaktionsteknik i VR. Jag tror personligen att man ska akta sig f&ouml;r att fastna i samma metaforer som man har i 2D-datorprogram, att man faktiskt m&aring;ste v&aring;ga t&auml;nka nytt. Det &auml;r faktiskt en ny situation. Detta borde man se som n&aring;got inspirerande ist&auml;llet f&ouml;r begr&auml;nsande! H&auml;r har vi ju ett omr&aring;de som folk inte bem&auml;strat i &aring;rhundraden, och som d&auml;rmed &auml;r mycket m&ouml;jligt att p&aring;verka.<br /> </p><p>Jag t&auml;nker faktiskt avsluta min lilla mini-artikelserie h&auml;r. Jag hoppas att den har erbjudit n&aring;gon stunds intressant l&auml;sning och att du kanske l&auml;rt dig n&aring;got du inte visste innan. Tack f&ouml;r uppm&auml;rksamheten!<br /> </p>		</div>
		<div id="signatur">
						<a href="/forfattare/1"><img src="/bilder/forfattarbilder/1.jpg" alt="Anders Fjeldstad"/></a>
						<p style="padding-top: 60px;">
				<a href="/forfattare/1">Anders Fjeldstad</a><br/>
				Publicerad 17 oktober 2005			</p>
			<div class="clear"></div>
		</div>
	</div>
</div>
					<div style="clear: both;"></div>
				</div>
				<div id="sidfot">
					<p>Copyright &copy; 2005 <a href="/forfattare">Anders Fjeldstad et al.</a></p>
				</div>
			</div>
			<div id="box_nere"></div>
		</div>
		
	</body>
</html>
