---
title: Om VR, del 4: Haptisk återkoppling
permalink: /artikel/315
---

<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" xml:lang="sv" lang="sv">
	<head>
		<title>Fjeldstad.se - En hel massa artiklar, helt enkelt</title>
		<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1"/>
		<meta name="author" content="Anders Fjeldstad et al."/>
		<link rel="stylesheet" href="/fjeldstad.css" type="text/css"/>
		<link rel="shortcut icon" href="/bilder/favicon.ico" type="image/favicon"/>
		<script type="text/javascript" src="/fjeldstad.js"></script>
			</head>
	<body>
		<div id="box">
			<div id="box_uppe"></div>
			<div id="box_mitten">
				<div id="navigering">
					<!-- Det a-element som är aktivt ska ha id 'navigering_aktiv' -->
					<a  href="/start"><img src="/bilder/design/start_inaktiv.jpg" alt="Start"/></a>
					<a href="/artikelarkiv"><img src="/bilder/design/artikelarkiv_inaktiv.jpg" alt="Artikelarkiv"/></a>
					<a href="/forfattare"><img src="/bilder/design/forfattare_inaktiv.jpg" alt="Författare"/></a>
					<a href="/om"><img src="/bilder/design/omfjeldstadse_inaktiv.jpg" alt="Om Fjeldstad.se"/></a>
					<a href="/kontakt"><img src="/bilder/design/kontakt_inaktiv.jpg" alt="Kontakt"/></a>
					<a href="/skriv"><img src="/bilder/design/skriv_inaktiv.jpg" alt="Skriv!"/></a>
				</div>
				<div id="arbetsyta">
					<div id="vansterspalt">
		<div style="margin-top: 30px;"></div>
	
	
		<h3>Relaterade artiklar</h3>
	<ul>
				<li><a href="/artikel/342" title="Kollektiv utbildning. Varför inte?">Kollektiv utbildning. Varf&ouml;r inte?</a></li>
				<li><a href="/artikel/323" title="Vetenskaplig visualisering">Vetenskaplig visualisering</a></li>
				<li><a href="/artikel/314" title="Om VR, del 5: Interaktion">Om VR, del 5: Interaktion</a></li>
				<li><a href="/artikel/316" title="Om VR, del 3: Tracking">Om VR, del 3: Tracking</a></li>
				<li><a href="/artikel/313" title="Om VR, del 2: Bildskärmsteknik">Om VR, del 2: Bildsk&auml;rmsteknik</a></li>
				<li><a href="/artikel/312" title="Om VR, del 1: Introduktion">Om VR, del 1: Introduktion</a></li>
			</ul>
	
	
	<h3>Skriv en kommentar</h3>
	<form action="/artikel/315" method="post">
		<div id="kommentarformular">
			
			<h6 class="mini"><label for="falt-namn">Ditt namn</label></h6>
			<input class="specialfalt" type="text" id="falt-namn" name="name" maxlength="30" value=""/>

			<h6 class="mini"><label for="falt-kommentar">Din kommentar</label></h6>
			<textarea id="falt-kommentar" name="comment" cols="30" rows="8"></textarea>

			<input class="botbane" style="float: right; margin-right: 5px;" type="submit" name="rensa" value="Rensa"/>
			<input class="knapp" style="float: right; margin-right: 7px;" type="submit" name="spara" value="Spara"/>
			<div class="clear"></div>
		</div>
	</form>

</div>
<div id="hogerspalt" style="margin-bottom: 0px;">
	<div id="artikel">
		<h1>Om VR, del 4: Haptisk &aring;terkoppling</h1>
		<div class="ingress">
			<p>&Auml;ven om vi kan se en fin visualisering av v&aring;r virtuella verklighet och dessutom navigera runt i den och kanske p&aring;verka objekten s&aring; &auml;r det en viktig komponent som fattas. Vi kan inte <em>k&auml;nna</em> det vi ser, rent fysiskt. Detta g&ouml;r naturligtvis att hela upplevelsen blir mindre &ouml;vertygande. H&auml;r kommer <em>haptisk &aring;terkoppling</em> in i bilden som en r&auml;ddare i&hellip;tja&hellip;n&ouml;den.</p>		</div>
		<div>
			<p>Haptik handlar per definition om upplevelsen och resultatet av att fysiskt r&ouml;ra vid saker. Detta &auml;r n&aring;got vi ser som naturligt i v&aring;r vardag; att kunna manipulera objekt och f&aring; en k&auml;nsla f&ouml;r deras egenskaper genom att ta p&aring; dem. Eftersom det kan bidra starkt till n&auml;rvarok&auml;nslan i en VR-milj&ouml; vill man skapa konstgjord haptisk &aring;terkoppling, vilket har visat sig inte vara helt l&auml;tt.</p> <p>Det man vill &aring;stadkomma &auml;r allts&aring; att kunna &aring;terskapa en k&auml;nsla av krafter samt att l&aring;ta anv&auml;ndaren anv&auml;nda sitt k&auml;nselsinne f&ouml;r att unders&ouml;ka och p&aring;verka den virtuella v&auml;rlden. Man ska kunna <em>k&auml;nna</em> att objekten har en massa, att deras ytor har olika egenskaper och s&aring; vidare. F&ouml;r att detta ska bli m&ouml;jligt m&aring;ste man i dagsl&auml;get anv&auml;nda sig av n&aring;gon typ av h&aring;rdvara f&ouml;r &quot;utmatning&quot; fr&aring;n systemet.</p> <p><strong>En mycket enkel</strong> form av haptisk &aring;terkoppling hittar vi till exempel i handkontrollerna till dagens vanliga spelkonsoler. H&auml;r anv&auml;ndes <em>vibrationer </em>f&ouml;r att till exempel illustrera att spelaren k&ouml;rt sin rallybil av v&auml;gen och nu &auml;r ute i den fria terr&auml;ngen. Detta fungerar hyfsat bra i vissa situationer, men &auml;r naturligtvis inget alternativ om man vill skapa en k&auml;nsla av mer komplicerade krafter.</p> <p><strong>Ett annat exempel</strong> p&aring; primitiv (men ibland effektiv) haptisk &aring;terkoppling &auml;r biografer med &quot;hydrauliska biostolar&quot; d&auml;r publiken skumpar omkring lutar i kurvor och s&aring; vidare. Det kan visserligen k&auml;nnas h&auml;ftigt och f&ouml;rh&ouml;ja upplevelsen, men har ett begr&auml;nsat anv&auml;ndningsomr&aring;de och passar kanske b&auml;st till enklare simuleringar av berg-och-dalbanor eller liknande snabba &aring;kturer.</p> <p><strong>Mer sofistikerad haptisk utrustning</strong> finns naturligtvis, och bygger oftast p&aring; mekaniska l&ouml;sningar. Ett exempel &auml;r de <a title="Info om Phantom" target="_self" href="http://www.sensable.com/products/phantom_ghost/phantom-desktop.asp"><em>Phantom</em>-enheter</a> som finns i VR-labbet p&aring; NVIS h&auml;r i Norrk&ouml;ping. Dessa best&aring;r av en ledad arm som fungerar som mekaniskt haptik- och trackingsystem p&aring; samma g&aring;ng, vilket &auml;r smidigt eftersom hela principen med att r&ouml;ra vid- och manipulera objekt naturligtvis bygger p&aring; att systemet vet var anv&auml;ndaren petar n&aring;gonstans. Rent gr&auml;nssnittsm&auml;ssigt anv&auml;nder man Phantom genom att h&aring;lla i den yttersta leden som fungerar som ett pennliknande verktyg.<br /> </p> <p>Phantom-systemet erbjuder h&ouml;g noggrannhet med en uppl&ouml;sning p&aring; ungef&auml;r 0,02 mm med avseende p&aring; positionen av &quot;pennspetsen&quot;. Uppdateringsfrekvensen m&aring;ste vara h&ouml;g f&ouml;r att systemet ska vara effektivt, och ligger p&aring; cirka 1000 Hz. Eftersom trackingen och &aring;terkopplingen &auml;r s&aring; precis kan man till exempel simulera oj&auml;mnheter i objektens ytor och liknande. D&auml;remot uppst&aring;r problem om man vill &aring;terskapa k&auml;nslan av tunga objekt, eftersom systemet inte kan leverera s&aring; v&auml;rst mycket kraft. Dessutom &auml;r det inte alltid naturligt att interagera med VR-milj&ouml;n genom att peta med en pinne p&aring; den, men det finns helt klart omr&aring;den d&auml;r det fungerar utm&auml;rkt. Medicinska simuleringar &auml;r ett s&aring;dant exempel.</p> <p>Rent tekniskt fungerar &aring;terkopplingen s&aring; att ett virtuellt objekt, en s&aring; kallad <em>proxy</em>, placeras ut i den virtuella v&auml;rlden p&aring; motsvarande position som pennspetsen har i den verkliga v&auml;rlden (och som sp&aring;ras genom det mekaniska systemet). N&auml;r anv&auml;ndaren flyttar runt pennan (och d&auml;rmed proxyobjektet) och st&ouml;ter in i virtuella objekt och liknande, ger utrustningen riktade krafter som &auml;r <em>proportionella mot avst&aring;ndet mellan proxyobjektet och pennspetsen</em>. Detta inneb&auml;r att den verkliga pennspetsen till&aring;ts passera genom ytor n&aring;got, just f&ouml;r att systemet enkelt ska kunna r&auml;kna ut vilken motriktad kraft som ska produceras.</p><p><strong>Interaktion med Phantom-pennor i all &auml;ra</strong>, men vore det inte b&auml;ttre om man faktiskt kunde anv&auml;nda sina h&auml;nder till att pilla p&aring; grejerna i scenen? Naturligtvis skulle det vara &auml;nnu l&auml;ckrare och framf&ouml;rallt k&auml;nnas mer naturligt f&ouml;r anv&auml;ndaren. Problemet &auml;r att det inte &auml;r helt l&auml;tt att l&ouml;sa rent tekniskt. Det existerar faktiskt &quot;handskar&quot; med haptisk &aring;terkoppling, till exempel f&ouml;retaget Immersion's <a href="http://www.immersion.com/3d/products/cyber_grasp.php" target="_self" title="Info om CyberGrasp"><em>CyberGrasp</em></a>. Med s&aring;dana p&aring; h&auml;nderna kan anv&auml;ndaren k&auml;nna objekten som om denne h&ouml;ll i dem p&aring; riktigt, med ett viktigt undantag &ndash; de kommer att k&auml;nnas viktl&ouml;sa. Synd. Inte s&aring; konstigt dock, eftersom det skulle kr&auml;vas n&aring;gon slags f&ouml;rankrad &quot;arm&quot; som drog i h&auml;nderna f&ouml;r att anv&auml;ndaren skulle kunna uppleva krafter som inte har med sj&auml;lva &quot;kl&auml;mmandet&quot; att g&ouml;ra. Och naturligtvis har man konstruerat s&aring;dana armar! Men nu b&ouml;rjar vi snacka <strong>klumpighet </strong>h&auml;r. N&auml;r h&auml;nderna p&aring; ett direkt s&auml;tt sitter fast i ledade metallarmar &auml;r anv&auml;ndaren inte s&auml;rskilt fri att r&ouml;ra sig runt i rummet, vilket f&aring;r ses som en stor nackdel. Dessutom &auml;r systemet inte s&auml;rskilt kraftfullt n&auml;r det g&auml;ller att simulera tyngre objekt.<br /> </p>  <h3>Till&auml;mpningar</h3>  <p>Vad ska man d&aring; anv&auml;nda haptiska VR-system till? Det &auml;r ju ganska l&aring;ngt kvar tills vi kan g&aring; omkring i en virtuell v&auml;rld och hantera objekten som vi skulle gjort i verkligheten&hellip;finns det n&aring;gra till&auml;mpningsomr&aring;den redan idag? Javisst! H&auml;r &auml;r n&aring;gra exempel:</p>  <ul> <li><strong>Tr&auml;ningsprogram.</strong> Inom till exempel kirurgi finns det m&ouml;jliga scenarion som inneh&aring;ller kritiska moment som &auml;r sv&aring;ra att tr&auml;na p&aring; och samtidigt kan vara avg&ouml;rande f&ouml;r, i v&auml;rsta fall, liv och d&ouml;d f&ouml;r en patient. Genom att tr&auml;na med hj&auml;lp av VR-teknik (d&auml;r haptisk &aring;terkoppling &auml;r viktigt f&ouml;r att ge r&auml;tt &quot;k&auml;nsla&quot;) kan kirurgen f&ouml;rbereda sig b&auml;ttre och d&auml;rmed b&auml;ttra p&aring; f&ouml;ruts&auml;ttningarna f&ouml;r lyckade &quot;skarpa&quot; ingrepp. Liknande situationer finns inom milit&auml;r tr&auml;ning (fast med helt annan typ av utrustning f&ouml;rst&aring;s) d&auml;r det kanske fr&auml;mst &auml;r ekonomin som s&auml;tter gr&auml;nser f&ouml;r hur mycket man kan tr&auml;na med den &quot;verkliga&quot; utrustningen. Sofistikerade flygsimulatorer l&aring;ter piloter tr&auml;na p&aring; komplicerade uppdrag utan att kr&auml;va att man h&aring;ller riktiga flygplan i luften.</li><li><strong>Industriell design. </strong>Ist&auml;llet f&ouml;r dyra fysiska modeller kan man med haptisk teknik simulera till exempel &quot;k&auml;nslan&quot; i en v&auml;xell&aring;da under utvecklingsfasen. Detta &auml;r n&aring;got som Scania faktiskt har gjort p&aring; riktigt.</li><li><strong>Fj&auml;rrstyrning.</strong> M&auml;nniskor kan p&aring; ett s&auml;kert avst&aring;nd men med h&ouml;g n&auml;rvarok&auml;nsla styra till exempel robotar som arbetar i farliga milj&ouml;er.</li><li><strong>Dataunders&ouml;kning.</strong> Det &auml;r m&ouml;jligt att unders&ouml;ka stora tredimensionella datam&auml;ngder p&aring; ett helt nytt s&auml;tt genom att anv&auml;nda haptik. Till exempel kan man f&aring; en intuitiv k&auml;nsla f&ouml;r luftstr&ouml;mmarna kring ett fordon i en simulering genom &aring;terkoppling riktad till k&auml;nslosinnet. <br /> </li> </ul> <p><strong>Till sist</strong> kan vi nog dra slutsatsen att det &auml;r en l&aring;ng v&auml;g till ett dynamiskt och kraftfullt system f&ouml;r haptisk &aring;terkoppling. Samtidigt &auml;r det ett omr&aring;de som s&auml;kert &auml;r v&auml;rt att l&auml;gga ned tid och m&ouml;da (och pengar) p&aring;, eftersom resultatet &auml;r anv&auml;ndbart och i h&ouml;g grad bidrar till n&auml;rvarok&auml;nslan i VR-v&auml;rldar.</p>		</div>
		<div id="signatur">
						<a href="/forfattare/1"><img src="/bilder/forfattarbilder/1.jpg" alt="Anders Fjeldstad"/></a>
						<p style="padding-top: 60px;">
				<a href="/forfattare/1">Anders Fjeldstad</a><br/>
				Publicerad 17 oktober 2005, uppdaterad 18 oktober 2005			</p>
			<div class="clear"></div>
		</div>
	</div>
</div>
					<div style="clear: both;"></div>
				</div>
				<div id="sidfot">
					<p>Copyright &copy; 2005 <a href="/forfattare">Anders Fjeldstad et al.</a></p>
				</div>
			</div>
			<div id="box_nere"></div>
		</div>
		<script src="http://www.google-analytics.com/urchin.js" type="text/javascript"></script>
		<script type="text/javascript">
			_uacct = "UA-342048-1";
			urchinTracker();
		</script>
	</body>
</html>
