---
permalink: /artikel/319/index.html
---

<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" xml:lang="sv" lang="sv">
	<head>
		<title>Fjeldstad.se - En hel massa artiklar, helt enkelt</title>
		<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1"/>
		<meta name="author" content="Anders Fjeldstad et al."/>
		<link rel="stylesheet" href="/fjeldstad.css" type="text/css"/>
		<link rel="shortcut icon" href="/bilder/favicon.ico" type="image/favicon"/>
		<script type="text/javascript" src="/fjeldstad.js"></script>
			</head>
	<body>
		<div id="box">
			<div id="box_uppe"></div>
			<div id="box_mitten">
				<div id="navigering">
					<!-- Det a-element som är aktivt ska ha id 'navigering_aktiv' -->
					<a  href="/start"><img src="/bilder/design/start_inaktiv.jpg" alt="Start"/></a>
					<a href="/artikelarkiv"><img src="/bilder/design/artikelarkiv_inaktiv.jpg" alt="Artikelarkiv"/></a>
					<a href="/forfattare"><img src="/bilder/design/forfattare_inaktiv.jpg" alt="Författare"/></a>
					<a href="/om"><img src="/bilder/design/omfjeldstadse_inaktiv.jpg" alt="Om Fjeldstad.se"/></a>
					<a href="/kontakt"><img src="/bilder/design/kontakt_inaktiv.jpg" alt="Kontakt"/></a>
					<a href="/skriv"><img src="/bilder/design/skriv_inaktiv.jpg" alt="Skriv!"/></a>
				</div>
				<div id="arbetsyta">
					<div id="vansterspalt">
		<div id="artikel-bilder">
		<img src="http://gamla.fjeldstad.se/dropshadow.php?image=bilder/titelbilder/319.jpg" alt="iTunes vs. Winamp enligt Anders"/>
	</div>
	
		<h3>Externa länkar</h3>
	<ul>
				<li><a href="http://www.itunes.com/" title="iTunes">iTunes</a></li>
				<li><a href="http://www.winamp.com/" title="Winamp">Winamp</a></li>
			</ul>
	
	
		<h3>Läsarnas kommentarer</h3>
	<ul id="kommentarlista">
				<li><span>1. Samuel Sj&ouml;berg <span>22 oktober 2005</span></span><div class="avdelare"></div><p>iTunes var en riktigt minnes- och processortjuv p&aring; Windows n&auml;r jag provade det. Winamp tog 6-7% n&auml;r iTunes beh&ouml;vde 30%. Nu k&ouml;r jag iTunes p&aring; macen och tycker det &auml;r helt underbart. &Aring; andra sidan har jag gett upp kontrollen av hur filerna sorteras p&aring; h&aring;rddisken. Filterfunktionen &auml;r naturligtvis otroligt snabb, men fr&aring;gan &auml;r hur den fungerar p&aring; Windows.</p></li>
				<li><span>2. Samuel Sj&ouml;berg (forts.) <span>22 oktober 2005</span></span><div class="avdelare"></div><p>Det allra trevligaste med iTunes f&ouml;r Mac &auml;r att man kan anv&auml;nda t.ex. SizzelingKeysForItunes f&ouml;r att styra programmet utan att s&auml;tta det i fokus. Och f&ouml;r att &aring;terkoppla till CPU-kraft som kr&auml;vs s&aring; verkar iTunes b&auml;ttre optimerat f&ouml;r mac, runt 6% verkar det anv&auml;nda.

(&Auml;r det inte lite sn&aring;lt att bara till&aring;ta 500 tecken per kommentar? Gargh... sen har du en tajmer ocks&aring;.)</p></li>
				<li><span>3. Damir <span>23 oktober 2005</span></span><div class="avdelare"></div><p>Jag f&aring;r intrycket av att du &auml;r ganska subjektiv i din bed&ouml;mning.</p></li>
				<li><span>4. Anders <span>23 oktober 2005</span></span><div class="avdelare"></div><p>Det &auml;r jag. Jag gillar Winamp fr&aring;n b&ouml;rjan, men faktum &auml;r att jag &auml;nd&aring; installerade iTunes eftersom jag ville veta om det var n&aring;got att satsa p&aring;. Jag &auml;r inte om&ouml;jligt enkelsp&aring;rig, men som det verkar s&aring; &auml;r Windowsversionen inte alls lika het som Macvarianten, vilket g&ouml;r att jag beh&aring;ller Winamp tills vidare.</p></li>
				<li><span>5. N&aring;gon annan <span>23 oktober 2005</span></span><div class="avdelare"></div><p>Annars finns ju alltid en betaversion av XMMS2, en musikserver d&auml;r man kopplar upp sig via en klient och lyssnar p&aring; musiken p&aring; s&aring; s&auml;tt. Det &auml;r ett annat s&auml;tt att t&auml;nka p&aring;, vilket jag tror kan fungera i framtiden, eller m&ouml;jligtvis totalf&ouml;rsvinna. Lite h&auml;ftigt &auml;r det. Rent subjektivt.</p></li>
				<li><span>6. Per Olofsson <span>13 november 2005</span></span><div class="avdelare"></div><p>Kan bara s&auml;ga en sak, iTunes variant p&aring; att slumpa fram l&aring;tar &auml;r fortfarande det enda argument jag beh&ouml;ver f&ouml;r att dumpa winamp i papperskorgen. Minne kostar heller inget idag s&aring; jag v&auml;ljer iTunes</p></li>
				<li><span>7. Peter <span>19 november 2005</span></span><div class="avdelare"></div><p>Jag tycker att de b&aring;da programmen riktar sig till tv&aring; olika sorters anv&auml;ndare och behov. iTunes &auml;r stort (Tar mycket plats p&aring; sk&auml;rmen) och st&ouml;djer s&ouml;kfunktioner etc. som inte WinAmp g&ouml;r. Winamp &auml;r litet (b&aring;de p&aring; sk&auml;rmen och i kb) och har de basfunktioner som beh&ouml;vs f&ouml;r att kunna lyssna p&aring; musik. J&auml;mf&ouml;r Beep-media-player och Amarok, samma sak d&auml;r. Vad vill man ha, minimalistiskt eller bulkvara?</p></li>
				<li><span>8. Anders <span>19 november 2005</span></span><div class="avdelare"></div><p>Till&auml;ggas b&ouml;r nog, inser jag, att det inte g&aring;r att p&aring; ett r&auml;ttvist s&auml;tt j&auml;mf&ouml;ra tv&aring; program i olika versioner (relativt sett). N&auml;r jag skrev min artikel s&aring; anv&auml;nde jag senaste windowsversionen av iTunes och en flera &aring;r gammal version av Winamp. Mycket har h&auml;nt med Winamp sedan dess, och mycket &auml;r till det s&auml;mre. Det tar inte l&auml;ngre en sekund att starta (p&aring; min dator) utan mycket mer. Dessutom tar det i sitt grundutseende mycket mer plats p&aring; sk&auml;rmen och har en massa funktioner som g&ouml;r det mer likt iTunes &auml;n innan.</p></li>
				<li><span>9. Jesper <span>11 december 2005</span></span><div class="avdelare"></div><p>T&auml;nkte precis s&auml;ga att alal de d&auml;r funktionerna som du b&aring;da gillar och ogillar finns numera ocks&aring; i winamp. Jag anv&auml;nder b&aring;da programmen f&ouml;r jag m&aring;ste anv&auml;nda itunes till att ladda upp till ipoden, men jag gillar winamp f&ouml;r uppspelning. Itunes har n&aring;gra funktioner som inte finns i winamp, som utdelningen &ouml;ver lan m.m. Men klarar inte av att k&ouml;a filer i redan gjorda spellistor. S&aring; vida jag inte bara har missat detta redan.</p></li>
			</ul>
	
	

</div>
<div id="hogerspalt" style="margin-bottom: 0px;">
	<div id="artikel">
		<h1>iTunes vs. Winamp enligt Anders</h1>
		<div class="ingress">
			<p>Jag har anv&auml;nt Winamp sedan jag spelade min f&ouml;rsta MP3-fil 1997, eller n&auml;r det nu var. H&auml;rom veckan laddade jag dock ner iTunes f&ouml;r att testa hur det fungerar, och f&ouml;r att se vad det egentligen &auml;r Mac-fantasterna talar om.</p>		</div>
		<div>
			<p>Jag vill b&ouml;rja med att s&auml;ga att jag inte gjort n&aring;gon slags objektiv och fullst&auml;ndig j&auml;mf&ouml;relse mellan Winamp och iTunes, utan mer vill dela med mig av mina spontana intryck och tankar.</p> <h3>iTunes</h3> <p>Apples iTunes &auml;r inte en musikspelare egentligen, utan mer som en slags mediacentral d&auml;r man kan (f&ouml;rs&ouml;ka) h&aring;lla reda p&aring; s&aring;v&auml;l musik och film som webbradiokanaler och iPod:en. I installationen ing&aring;r &auml;ven Quicktime, som &auml;r Apples filmspelare.<br /> </p> <p>Det f&ouml;rsta som slog mig &auml;r hur <em>stort</em> iTunes &auml;r. Installationen tar omkring 30 Mb (om jag inte missminner mig) och n&auml;r programmet &auml;r ig&aring;ng slukar det ungef&auml;r 45 Mb arbetsminne i en enda tugga.</p> <p>Det som f&ouml;r mig &auml;r mest karakt&auml;ristiskt med iTunes &auml;r s&ouml;kfunktionen, som egentligen &auml;r ett filter. Fr&aring;n b&ouml;rjan listas alla filer i ett visst bibliotek, och genom att skriva in en s&ouml;kstr&auml;ng kan man filtrera bort de filer som inte uppfyller kriteriet. Principen &auml;r smart tycker jag, eftersom man s&auml;llan beh&ouml;ver skriva in mer &auml;n ungef&auml;r tre tecken f&ouml;rr&auml;n man hittat det man s&ouml;ker efter.</p> <h3>Winamp</h3> <p>Winamp b&ouml;rjade som en renodlad ljudspelare men har p&aring; senare tid ocks&aring; f&ouml;rvandlats till n&aring;got annat slags djur. Exempelvis kan man spela film med programmet, om man vill. Det vill inte jag, s&aring; jag har inte den funktionen installerad och ska d&auml;rf&ouml;r inte uttala mig om hur den fungerar.</p> <p>Musikuppspelning &auml;r Winamp bra p&aring;, enligt mig. Det &auml;r enkelt att l&auml;gga till l&aring;tar i en spellista, spara listor, spela upp hela kataloger och s&aring; vidare. Grundl&auml;ggande funktionalitet som beh&ouml;vs, allts&aring;.</p> <p>N&aring;got jag gillar med Winamp &auml;r att det startar snabbt och tar f&ouml;rh&aring;llandevis litet minne. N&auml;r det &auml;r ig&aring;ng anv&auml;nder det ungef&auml;r 10 Mb arbetsminne och sj&auml;lva programmet tar upp knappt 2 Mb p&aring; disken.</p> <h3>Synpunkter</h3> <p>Jag gottar mig &aring;t filtreringss&ouml;kningen i iTunes. Men. Den &auml;r <em>mycket l&aring;ngsam</em>. Jag vet inte om det g&aring;r att st&auml;lla in p&aring; n&aring;got s&auml;tt (jag har letat) men i dess nuvarande tillst&aring;nd tillfogar den mig s&aring;dan frustration att jag om&ouml;jligen kan anv&auml;nda den.</p><p>En f&ouml;rdel med iTunes &auml;r att musiken (jag fokuserar p&aring; musik eftersom det &auml;r det jag anv&auml;nder Winamp till) kan sorteras efter genre och att man kan f&aring; en lista med alla artister och deras album. Winamp har n&aring;got slags bibliotek med (antar jag) liknande funktionalitet, men den kan jag inte uttala mig om eftersom jag inte anv&auml;nt den.</p><p>H&auml;r kommer vi dock till en f&ouml;rbryllande faktor som p&aring;verkat mig i mitt val av musikspelare. N&auml;r jag st&auml;lls inf&ouml;r en lista som inneh&aring;ller alla l&aring;tar jag &auml;ger s&aring; drabbas jag av akut informations&ouml;verfl&ouml;de. Jag kan inte komma p&aring; vad jag vill lyssna p&aring;. Mycket konstigt, kanske rentav kn&auml;ppt, men framf&ouml;rallt irriterande.</p><p>Detta syndrom tillsammans med det faktum att jag inte orkar v&auml;nta i 20 sekunder p&aring; att programmet ska starta (eller &auml;gna n&auml;stan 50 Mb arbetsminne &aring;t att l&aring;ta det vara ig&aring;ng alltid) g&ouml;r att iTunes fick stryka p&aring; foten. Winamp best&aring;r.</p><p>Detta &auml;r allts&aring; mina egna f&ouml;rh&aring;llandevis subjektiva &aring;sikter och st&auml;llningstaganden. Kommentarer och alternativa synpunkter v&auml;lkomnas varmt!&nbsp;</p>		</div>
		<div id="signatur">
						<a href="/forfattare/1"><img src="/bilder/forfattarbilder/1.jpg" alt="Anders Fjeldstad"/></a>
						<p style="padding-top: 60px;">
				<a href="/forfattare/1">Anders Fjeldstad</a><br/>
				Publicerad 21 oktober 2005			</p>
			<div class="clear"></div>
		</div>
	</div>
</div>
					<div style="clear: both;"></div>
				</div>
				<div id="sidfot">
					<p>Copyright &copy; 2005 <a href="/forfattare">Anders Fjeldstad et al.</a></p>
				</div>
			</div>
			<div id="box_nere"></div>
		</div>
		<script src="http://www.google-analytics.com/urchin.js" type="text/javascript"></script>
		<script type="text/javascript">
			_uacct = "UA-342048-1";
			urchinTracker();
		</script>
	</body>
</html>
