---
permalink: /artikel/335/index.html
---

<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" xml:lang="sv" lang="sv">
	<head>
		<title>Fjeldstad.se - En hel massa artiklar, helt enkelt</title>
		<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1"/>
		<meta name="author" content="Anders Fjeldstad et al."/>
		<link rel="stylesheet" href="/fjeldstad.css" type="text/css"/>
		<link rel="shortcut icon" href="/bilder/favicon.ico" type="image/favicon"/>
		<script type="text/javascript" src="/fjeldstad.js"></script>
			<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
  ga('create', 'UA-342048-12', 'fjeldstad.se');
  ga('send', 'pageview');
</script>
</head>
	<body>
		<div id="box">
			<div id="box_uppe"></div>
			<div id="box_mitten">
				<div id="navigering">
					<!-- Det a-element som är aktivt ska ha id 'navigering_aktiv' -->
					<a  href="/start"><img src="/bilder/design/start_inaktiv.jpg" alt="Start"/></a>
					<a href="/artikelarkiv"><img src="/bilder/design/artikelarkiv_inaktiv.jpg" alt="Artikelarkiv"/></a>
					<a href="/forfattare"><img src="/bilder/design/forfattare_inaktiv.jpg" alt="Författare"/></a>
					<a href="/om"><img src="/bilder/design/omfjeldstadse_inaktiv.jpg" alt="Om Fjeldstad.se"/></a>
					<a href="/kontakt"><img src="/bilder/design/kontakt_inaktiv.jpg" alt="Kontakt"/></a>
					<a href="/skriv"><img src="/bilder/design/skriv_inaktiv.jpg" alt="Skriv!"/></a>
				</div>
				<div id="arbetsyta">
					<div id="vansterspalt">
		<div id="artikel-bilder">
		<img class="dropshadow" src="/bilder/titelbilder/335.jpg" alt="Lögner"/>
	</div>
	
	
	
	
	

</div>
<div id="hogerspalt" style="margin-bottom: 0px;">
	<div id="artikel">
		<h1>L&ouml;gner</h1>
		<div class="ingress">
			<p>Min flickv&auml;n har under senaste tiden filosoferat p&aring; &auml;kthet/&auml;rlighet och sanning kontra l&ouml;gn, och som den kompulsiva analytiker jag &auml;r har jag mer &auml;n g&auml;rna h&auml;ngt p&aring; i resonemanget.</p>		</div>
		<div>
			<p><br /> Lunchblogg. Bra med h&auml;mtmat. Man f&aring;r tid &ouml;ver till att blogga. Inte bra att anv&auml;nda tiden till att jobba - lunchen &auml;r till f&ouml;r att pausa fr&aring;n arbetet.</p>           <p><br /> Anyhoo. Mer specifikt fokuserar sig hennes spekulerande i huruvida hur ens agerande gentemot andra &auml;r &auml;kta eller inte, och vad det har f&ouml;r konsekvenser, b&aring;de f&ouml;r ens integritet, och f&ouml;r ens relationer. </p>           <p><br /> Typexemplet &auml;r n&auml;r du k&auml;nner sig tr&ouml;tt och nere en dag, men ut&aring;t agerar glad och pigg i den gruppen du &auml;r i, eftersom det annars skulle p&aring;verka gruppen negativt, och &auml;ven dess syn p&aring; dig som person. Eller n&auml;r du ler och pratar med mycket personer p&aring; en fest, trots att du egentligen k&auml;nde f&ouml;r att sitta hemma ensam, &auml;ta pizza, och spela xbox.</p>           <p><br /> Min flickv&auml;n ser detta beteende som n&aring;got negativt. Hennes tes &auml;r att ett l&aring;ngvarigt s&aring;dant beteende slutligen mynnar ut i en slags fiktiv existens, d&auml;r m&auml;nniskor har en falsk uppfattning om en, och att man till slut b&ouml;rjar tvivla p&aring; vem man egentligen &auml;r.</p>           <p><br /> Eftersom jag absolut m&aring;ste spela dj&auml;vulens advokat i varje situation, och ganska nyligen har l&auml;sts Seth Godins intressanta bok &quot;All Marketers are Liars&quot;, s&aring; t&auml;nkte jag presentera en mot-tes (&Auml;r det ett ord, Davve?). N&auml;mligen den att l&ouml;gner ofta &auml;r n&aring;got v&auml;ldigt positivt, och ett verktyg som &auml;r n&ouml;dv&auml;ndigt f&ouml;r utveckling, b&aring;de f&ouml;r individer och m&auml;nskligheten som helhet.</p>                 <h3>Defintion<br />      </h3>                 <p>Susning(som jag refererar till eftersom mitt abbonemang p&aring; NE tagit slut) definerar l&ouml;gn p&aring; detta vis:</p>           <p><br />       L&ouml;gn kallas en utsaga som...</p>           <p><em><br />        &nbsp;&nbsp; 1. inte &auml;r sann</em></p>           <p><em>&nbsp;&nbsp; 2. uttrycks av n&aring;gon som vet att den inte &auml;r sann&lt;</em></p>           <p><em>&nbsp;&nbsp; 3. uttrycks med avsikt att f&aring; &aring;h&ouml;raren/l&auml;saren att tro att den &auml;r sann.</em> </p>           <p> ... vilket jag tycker &auml;r en fullt korrekt defintion. Men m&auml;rk v&auml;l att denna defintion av l&ouml;gnare innefattar personer s&aring;som sk&aring;despelare,&nbsp; regiss&ouml;rer, filmare och f&ouml;rfattare. Det &auml;r alla deras jobb att ljuga s&aring; bara in i helvete, och vi &auml;lskar dem f&ouml;r det. I denna kontext kan l&ouml;gnen vara mycket positiv. </p>        <h3>Den eviga kampen: Coca-Cola vs. Pepsi</h3>      <p> Ett annat intressant exempel &auml;r Coca-Cola. Statistiskt sett &auml;r Pepsi godare &auml;n Coca-Cola. G&ouml;r man ett blindtest med en stor m&auml;ngd m&auml;nniskor, s&aring; &auml;r Pepsi godare. Punkt slut. Pepsi f&ouml;rs&ouml;kte visa upp detta i sin marknadsf&ouml;ring under en ganska l&aring;ng period, men slutade med det efter ett tag, troligen p&aring; grund av att det var ineffektivt. Det intressanta med detta &auml;r att om du g&ouml;r om exakt samma blindtest, fast med etiketter p&aring; burkarna, s&aring; s&auml;ger urvalsgruppen att Coca-Cola godare! Att Coca-Cola generellt sett anses som godare beror allts&aring; inte p&aring; smak&auml;mnena i drycken, utan p&aring; de som konsumerar drycken. Coca-Cola drickare S&Auml;GER att Coca-Cola &auml;r godare, och s&aring;ledes &auml;r den godare. </p>            <p><br /> Visst, vi kan citera resultaten fr&aring;n blindtesten genom en megafon om vi vill (som Pepsi gjorde) men det &auml;ndrar inte det faktum att Coca-Cola &auml;r godare n&auml;r vi ser burken, och burken &auml;r en del av produken i allra h&ouml;gsta grad. F&ouml;r att sammanfatta, n&auml;r tillr&auml;ckligt m&aring;nga personer ljuger om n&aring;got och g&ouml;r det tillr&auml;ckligt &ouml;vertygande, s&aring; &auml;r det inte l&auml;ngre en l&ouml;gn. Det &auml;r i allra h&ouml;gsta grad en sanning. </p>       <h3>Vinglasen som smakar gott</h3>      <p> Vidare exempel p&aring; det h&auml;r &auml;r ett f&ouml;retag i USA som tillverkar olika former av dricksglas, specifikt anpassade f&ouml;r olika drycker. Espressoglas, whiskeyglas, &ouml;lglas, och vinglas. Vad som g&ouml;r detta f&ouml;retaget lite speciellt &auml;r att de, p&aring; fullaste allvar, h&auml;vdar att dryckerna smakar b&auml;ttre i deras glas. </p>            <p><br /> &quot;Absurt!!&quot;, s&auml;ger skeptikerna, och g&ouml;r ett blindtest, som prompt p&aring;visar att att p&aring;st&aring;endet &auml;r falskt. &quot;Hmm&quot;, s&auml;ger de k&auml;nda vink&auml;nnarna, och provar utan &ouml;gonbindlar, eftersom de inte har f&ouml;r vana att g&aring; till sin favoritrestaurang med &ouml;gonbindel (eftersom de skulle snubbla mycket och det skulle se ganska dumt ut). Vink&auml;nnarna &auml;r eniga; vin smakar b&auml;ttre i f&ouml;retagets glas. Antagligen f&ouml;r att vin BORDE smaka b&auml;ttre i vackra glas som bl&aring;sts med eftertanke och passion, &auml;n i en plastig turtles-mugg som gjorts i 12 miljoner exemplar i Kina. Eftersom vinkonsumenterna lyssnar p&aring; de k&auml;nda vink&auml;nnara, kommer de till samma slutsats - Vin smakar b&auml;ttre i f&ouml;retagets vinglas.</p>       <h3>Pengar - den st&ouml;rsta l&ouml;gnen n&aring;nsin   </h3>      <p> Det ultimata exemplet &auml;r v&aring;rt valutasystem. Dagligen g&aring;r vi omkring och byter sm&aring; papperslappar, tryckta p&aring; ett visst vis, och sm&aring; metallbitar, noggrant tillverkade av specifika metaller, och bytar dessa mot saker s&aring;som mat, kaffe, coca-cola, pepsi, vinglas och datorspel s&aring;som Rome - Total War. N&auml;r vi f&aring;r slut p&aring; papperslappar g&aring;r vi och jobbar extremt h&aring;rt hos n&aring;gon som har papperslappar, f&ouml;r att f&aring; papperslappar. Ganska nyligen har vi kommit p&aring; att det &auml;r opraktiskt med alla dessa papperslappar, och h&aring;ller p&aring; att byta ut papperslapparna mot siffror i en dator. Vissa siffror &auml;r v&auml;rda mer &auml;n andra. T.ex. &auml;r SEK mindre v&auml;rda &auml;n USD, men mer v&auml;rda &auml;n po&auml;ngen man f&aring;r p&aring; LunarStorm. OK, nu h&aring;ller jag p&aring; och flummar ut.</p>        <h3>Sanning </h3>      <p> Visst, du kan h&auml;vda att samtliga av ovanst&aring;ende exempel &auml;r illusioner, och inte verkliga, men jag s&auml;ga det uppenbara motargumentet: S&auml;lj pepsi i st&auml;llet f&ouml;r Coca-Cola, om det d&aring; &auml;r samma sak. Sanningen &auml;r att du kommer att s&auml;lja mer Coca-Cola, f&ouml;r att fler personer tycker/tror/ljuger att coca-cola &auml;r godare. I och med att alla tror p&aring; det som ursprungligen var en l&ouml;gn, s&aring; &auml;r det numera sanning. Coca-Cola &auml;r godare.</p>            <p><br /> P&aring; samma s&auml;tt kommer du att s&auml;lja vinglas b&auml;ttre &auml;n vin-turtles-plastmuggar, fast&auml;n det &auml;r &quot;samma sak&quot; enligt blindtesten. </p>           <p><br /> Och p&aring; samma s&auml;tt kommer folk att bli otroligt arga p&aring; dig om du br&auml;nner deras papperslappar. &quot;Varf&ouml;r det?&quot;, s&auml;ger du. &quot;De &auml;r ju inte v&auml;rda n&aring;got!&quot;. Jo, det &auml;r de, eftersom alla TROR att de &auml;r det. N&auml;r alla ljuger, &auml;r det sant!</p>           <p><br />      F&ouml;r att utveckla p&aring; detta:</p>       <h3><strong>En v&auml;ldigt bred eller ih&auml;rdig l&ouml;gn muterar f&ouml;rr eller senare till sanning. </strong></h3> <h3>Historien om en lat, l&ouml;gnaktig kille <br />      </h3>       <p> &nbsp;Ta t.ex. en person som inte f&aring;r s&aring; mycket gjort. Davve kallar vi honom. Han &auml;r lat. Han har inte lust att g&ouml;ra n&aring;got. Folk &auml;r r&auml;tt vana vid att han inte g&ouml;r ett skit, och arbetar sig ofta runt honom genom att inte ge honom n&aring;gra viktiga uppgifter.</p>           <p><br /> En dag best&auml;mmer Davve sig, utan speciell anledning, f&ouml;r att vara produktiv. Han k&auml;nner inte f&ouml;r det, men han beslutar sig &auml;nd&aring; f&ouml;r att ljuga f&ouml;r sig sj&auml;lv och sin omgivning att han &auml;r en produktiv person. Bara f&ouml;r en dag. S&aring; han &auml;r produktiv den dagen. Alla &auml;r f&ouml;rv&aring;nade och undrar om han blivit sjuk. N&auml;sta dag kommer, och han best&auml;mmer sig f&ouml;r att ljuga en g&aring;ng till. (Varf&ouml;r? Ingen som vet egentligen. M&auml;nniskor best&auml;mmer sig f&ouml;r konstiga saker ibland. V&auml;ldigt ofta faktiskt) Davve ljuger p&aring; sin andra dag p&aring; jobbet, f&ouml;r sig sj&auml;lv, och de andra. Han f&aring;r massor gjort! En spektakul&auml;r l&ouml;gn! Det g&aring;r lite l&auml;ttare den h&auml;r g&aring;ngen. Konstigt. Kanske f&ouml;r att han blivit b&auml;ttre p&aring; att manipulera sig sj&auml;lv. </p>           <p> S&aring;d&auml;r forts&auml;tter det ett tag. Ett par m&aring;nader. Ett halv&aring;r, faktiskt. S&aring; en dag best&auml;mmer sig Davve f&ouml;r att det inte &auml;r intressant att ljuga l&auml;ngre. Han g&aring;r till jobbet, och har slutat ljuga. L&auml;gger f&ouml;tterna p&aring; bordet, lutar sig tillbaka. - &quot;Ahhh.&quot; Men snart b&ouml;rjar det klia i fingrarna. Om man skulle ta och g&ouml;ra den d&auml;r layouten till Morgan. &quot;NEJ!&quot;, t&auml;nker han. &quot;Det &auml;r slut p&aring; charaden nu - jag &auml;r tillbaka till mitt lata, &auml;kta jag. Morgans layout beh&ouml;ver inte vara klar f&ouml;rr&auml;n n&auml;sta vecka - jag g&ouml;r det dagen innan. &quot;</p>           <p>N&auml;sta tanke kommer n&auml;stan omedelbart. &quot;Eller ringa Roffes D&auml;ckservice och pusha lite p&aring; dem om deras hemsida?&quot; Men det var d&aring; fan, t&auml;nker Davve. Vad som h&auml;nt &auml;r att Davves l&ouml;gn sleeveless muterat sig till en vana, som ett ih&auml;rdigt simulerande av beteende naturligtvis g&ouml;r (ett fenomen som sk&aring;despelare, atleter och artiser anv&auml;nder dagligen i sitt arbete). Inte nog med detta! Omgivningen uppfattning om Davve har f&ouml;r&auml;ndrats. Folk har b&ouml;rjat se honom som en p&aring;litlig och flitig person, vilket g&ouml;r det sv&aring;rt f&ouml;r honom att agera p&aring; ett annat s&auml;tt (precis som i det motsatta fallet). De litar p&aring; honom, och det g&ouml;r det sv&aring;rt f&ouml;r honom att bryta vanan och svika dem. </p>           <p> Davve har genom sin l&ouml;gn f&ouml;r&auml;ndrats, eftersom l&ouml;gnen blev en vana. F&ouml;r att f&ouml;r&auml;ndra tillbaka sig till sitt gamla lata jag, m&aring;ste han nu ljuga f&ouml;r sig sj&auml;lv igen, fast p&aring; andra h&aring;llet. </p>           <p><strong>       OK, nu har min lunch varat i 110 minuter. Back to work.</strong></p>		</div>
		<div id="signatur">
						<a href="/forfattare/12"><img src="/bilder/forfattarbilder/12.jpg" alt="Mattias Johansson"/></a>
						<p style="padding-top: 60px;">
				<a href="/forfattare/12">Mattias Johansson</a><br/>
				Publicerad 18 januari 2006			</p>
			<div class="clear"></div>
		</div>
	</div>
</div>
					<div style="clear: both;"></div>
				</div>
				<div id="sidfot">
					<p>Copyright &copy; 2005 <a href="/forfattare">Anders Fjeldstad et al.</a></p>
				</div>
			</div>
			<div id="box_nere"></div>
		</div>
		
	</body>
</html>
