---
permalink: /artikel/342
---

<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" xml:lang="sv" lang="sv">
	<head>
		<title>Fjeldstad.se - En hel massa artiklar, helt enkelt</title>
		<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1"/>
		<meta name="author" content="Anders Fjeldstad et al."/>
		<link rel="stylesheet" href="/fjeldstad.css" type="text/css"/>
		<link rel="shortcut icon" href="/bilder/favicon.ico" type="image/favicon"/>
		<script type="text/javascript" src="/fjeldstad.js"></script>
			</head>
	<body>
		<div id="box">
			<div id="box_uppe"></div>
			<div id="box_mitten">
				<div id="navigering">
					<!-- Det a-element som är aktivt ska ha id 'navigering_aktiv' -->
					<a  href="/start"><img src="/bilder/design/start_inaktiv.jpg" alt="Start"/></a>
					<a href="/artikelarkiv"><img src="/bilder/design/artikelarkiv_inaktiv.jpg" alt="Artikelarkiv"/></a>
					<a href="/forfattare"><img src="/bilder/design/forfattare_inaktiv.jpg" alt="Författare"/></a>
					<a href="/om"><img src="/bilder/design/omfjeldstadse_inaktiv.jpg" alt="Om Fjeldstad.se"/></a>
					<a href="/kontakt"><img src="/bilder/design/kontakt_inaktiv.jpg" alt="Kontakt"/></a>
					<a href="/skriv"><img src="/bilder/design/skriv_inaktiv.jpg" alt="Skriv!"/></a>
				</div>
				<div id="arbetsyta">
					<div id="vansterspalt">
		<div style="margin-top: 30px;"></div>
	
		<h3>Externa länkar</h3>
	<ul>
				<li><a href="http://www.dtr.isy.liu.se/sv/kurser/TSDT77" title="TSDT77 Digital kommunikation">TSDT77 Digital kommunikation</a></li>
			</ul>
	
		<h3>Relaterade artiklar</h3>
	<ul>
				<li><a href="/artikel/341" title="Sammanfattning av tentor i TSBK35">Sammanfattning av tentor i TSBK35</a></li>
				<li><a href="/artikel/323" title="Vetenskaplig visualisering">Vetenskaplig visualisering</a></li>
				<li><a href="/artikel/314" title="Om VR, del 5: Interaktion">Om VR, del 5: Interaktion</a></li>
				<li><a href="/artikel/315" title="Om VR, del 4: Haptisk återkoppling">Om VR, del 4: Haptisk &aring;terkoppling</a></li>
				<li><a href="/artikel/316" title="Om VR, del 3: Tracking">Om VR, del 3: Tracking</a></li>
				<li><a href="/artikel/313" title="Om VR, del 2: Bildskärmsteknik">Om VR, del 2: Bildsk&auml;rmsteknik</a></li>
				<li><a href="/artikel/312" title="Om VR, del 1: Introduktion">Om VR, del 1: Introduktion</a></li>
				<li><a href="/artikel/83" title="Digital kommunikation">Digital kommunikation</a></li>
				<li><a href="/artikel/78" title="Begrepp inom kompression av ljud och bild">Begrepp inom kompression av ljud och bild</a></li>
				<li><a href="/artikel/2" title="3D-grafik i korthet">3D-grafik i korthet</a></li>
			</ul>
	
		<h3>Läsarnas kommentarer</h3>
	<ul id="kommentarlista">
				<li><span>1. Punger <span>14 mars 2006</span></span><div class="avdelare"></div><p>&Auml;r det jag som &auml;r herren som satte h&ouml;gre fart p&aring; bollen som Anders b&ouml;rjade rulla? Jag skulle isf vilja tacka b&aring;de Anders f&ouml;r den trevliga sammanfattningen som allt b&ouml;rjade med. Dessutom Oskar &Aring;kerlund som gjorde samma sak som jag p&aring; IBR-kursen, vilket dock inte slog lika stort som denna, ty vi var en allt f&ouml;r liten grupp f&ouml;r att det skulle r&auml;knas som ett kollektiv. Jag &auml;r stolt &ouml;ver att vara en av f&auml;derna till den kollektiva utbildningen och om det kan g&ouml;ra Digital kommunikation-kursen h&auml;lften s&aring; tr&aring;kig som jag har h&ouml;rt Totte-Jesper-Daniel-g&auml;nget (Vilket Anders ocks&aring; ing&aring;r i d&aring; och d&aring;) s&aring; kanske vi slipper sova p&aring; alla f&ouml;rel&auml;sningar.</p></li>
				<li><span>2. Oskar <span>14 mars 2006</span></span><div class="avdelare"></div><p>L&aring;ter bra, men detta har redan G90 sysslat med i &aring;ratal. Vad &auml;r G90 f&ouml;rresten?</p></li>
				<li><span>3. Oskar <span>14 mars 2006</span></span><div class="avdelare"></div><p>F&ouml;r &ouml;vrigt tror jag det &auml;r en brun st&auml;llning att redan innan kursen klassa den som fruktansv&auml;rt tr&aring;kig... :) Vi kan v&auml;l hoppas p&aring; att den &auml;r rolig ist&auml;llet.  Modem &auml;ger!</p></li>
				<li><span>4. David <span>14 mars 2006</span></span><div class="avdelare"></div><p>Vem &auml;r G90?</p></li>
				<li><span>5. Peter <span>15 mars 2006</span></span><div class="avdelare"></div><p>Jag anser att Digicom-kursen &auml;r ganska sp&auml;nnande. Inl&auml;mningsuppgifterna g&ouml;r att den &auml;r genomlidlig s&aring; l&auml;nge det g&aring;r bra p&aring; dem. N&auml;r tentan v&auml;l kommer kan man n&ouml;ta inl&auml;mningsuppgifterna igen och s&aring; inser man att man faktiskt kan det. Det som suger med dem &auml;r att han g&aring;r igenom teorin f&ouml;r att l&ouml;sa dem f&ouml;rel&auml;sningen EFTER deadline. Huh?!
En annan positiv sak med kursen &auml;r att den till st&ouml;rsta del handlar om trigonometri och linj&auml;r algebra.</p></li>
			</ul>
	
	<h3>Skriv en kommentar</h3>
	<form action="/artikel/342" method="post">
		<div id="kommentarformular">
			
			<h6 class="mini"><label for="falt-namn">Ditt namn</label></h6>
			<input class="specialfalt" type="text" id="falt-namn" name="name" maxlength="30" value=""/>

			<h6 class="mini"><label for="falt-kommentar">Din kommentar</label></h6>
			<textarea id="falt-kommentar" name="comment" cols="30" rows="8"></textarea>

			<input class="botbane" style="float: right; margin-right: 5px;" type="submit" name="rensa" value="Rensa"/>
			<input class="knapp" style="float: right; margin-right: 7px;" type="submit" name="spara" value="Spara"/>
			<div class="clear"></div>
		</div>
	</form>

</div>
<div id="hogerspalt" style="margin-bottom: 0px;">
	<div id="artikel">
		<h1>Kollektiv utbildning. Varf&ouml;r inte?</h1>
		<div class="ingress">
			<p>En &quot;kommunistisk&quot; utbildningsstrategi som tidigare ej (?) genomf&ouml;rts, skulle det funka? Watch out, utbildningsministern! Heads up for the <em>kollektiv utbildning</em>!</p>		</div>
		<div>
			<h3>Det var en g&aring;ng f&ouml;r tv&aring; &aring;r sedan...<br /></h3><p>Fjeldstad.se:s alldeles egen fr&ouml;ken Fjeldstad satte f&ouml;r snart tv&aring; &aring;r sedan en boll i rullning med sin sammanfattning av 3d-grafikbegrepp. Anders pluggade till kursen <em>TNM077 3-D Datorgrafik och animering</em> och som en hj&auml;lpreda f&ouml;r sig sj&auml;lv skrev han ihop en sammanfattning; denna valde han att publicera f&ouml;r att andra skulle kunna ta del av den.</p><p>Under &aring;rens lopp har Anders fortsatt att publicera sina sammanfattningar. I <em>VR-teknikkursen</em> valde han att g&ouml;ra det i bloggform - ett intressant grepp som kanske inte &auml;r perfekt f&ouml;r utomst&aring;ende som vill klara tentan, men ur en medieanalytikers &ouml;gon underbart.</p><h3>Expos&eacute; &ouml;ver forna tentor<br /></h3><p>Det drar ihop sig till &auml;nnu en kompressionstenta, till vilken nyss n&auml;mnda Anders &aring;r 2005 skrev en teorisammanfattning som fick 200+ tr&auml;ffar sista dagarna f&ouml;re tentan. I &aring;r valde Mattias att g&ouml;ra en liten expos&eacute; &ouml;ver forna tentor i kuriosa- och studiesyfte.</p><p>Mattias j&auml;mf&ouml;rde teorifr&aring;gorna fr&aring;n de sex senaste tentorna, varp&aring; det uppdagades att m&aring;nga av fr&aring;gorna &auml;r t&auml;mligen &aring;terkommande. Han noterade &auml;ven hur m&aring;nga g&aring;nger varje fr&aring;ga hade dykt upp. Till sist har han, med utg&aring;ngspunkt fr&aring;n Anders sammanfattning, svarat p&aring; alla fr&aring;gorna. Vidare gjorde undertecknad en revidering och komplettering av Mattias svar.</p><h3>Formation collectif, entrez, s'il vous pla&icirc;t !</h3><p>I de klasser som l&auml;ser medietekniks (MT) tredje &aring;r 2006 har jag funnit en ovanlig v&auml;lvilja till att hj&auml;lpa till; de flesta l&auml;gger upp alla sina laborationer p&aring; sitt publika studentkonto. Har jag problem med en labb kanske n&aring;gon annan redan har gjort den och jag kan d&auml;r f&aring; tips p&aring; hur jag ska t&auml;nka.</p><p>Skulle man kunna ha klasser d&auml;r alla hj&auml;lper alla och till slut f&aring;r ett gemensamt betyg? Redan nu i kompressionen har vi sett tydliga indikationer p&aring; en samarbetsvilja. Det &auml;r detta som &auml;r grundstenen i vad vi ska testa.</p><p><strong>Kollektiv utbildning</strong>, var god stig p&aring;!&nbsp;</p><h3>Experiment i kollektiv utbildning: <em>TSDT77 Digital kommunikation</em>, period 4, 2006&nbsp;</h3><p>Jag och Emil ska b&ouml;rja, de som vill h&auml;nga p&aring; h&auml;nger p&aring;. Vi har h&ouml;rt mycket illa om <em>Digital kommunikation-</em>kursen, fr&auml;mst att den &auml;r fasansfullt tr&aring;kig. Att kollektivt l&auml;ra sig den genom samarbete, &auml;r det genomf&ouml;rbart?<br /></p><p><strong>EXPERIMENT</strong> Vi ska testa kollektiv utbildning; de som vill h&auml;nger p&aring;! Det kan vara tips till hur man l&ouml;ser inl&auml;mningsuppgifter, en post-it-lapp med n&aring;t begrepp eller en hyperlayoutad Indesign-kommunikationsstruktur &ouml;ver digitala system. Har du n&aring;got att bidra med - vad som helst som gynnar &ouml;kad f&ouml;rst&aring;else f&ouml;r och ben&auml;genhet att klara kursen -, g&ouml;r det; <strong>bidra!</strong><br /></p><p><strong>BETYG</strong> De som bidrar kommer betygs&auml;ttas - <strong>kollektivt</strong>. Efter avslutad kurs vore det kul om alla som bidragit skickade in sina betyg. Vi kommer snitta fram ett medel och g&ouml;ra statistik &ouml;ver vad bidragstagarna har f&aring;tt.<br /></p><p><strong>MATERIAL</strong> Allt material kommer l&auml;ggas ut p&aring; Fjeldstad eller n&aring;gon wiki, tillg&auml;ngligt f&ouml;r alla. Alla ska kunna dra nytta av detta experiment.</p><p><strong>HUR?</strong> F&ouml;r att vara med pratar man bara med mig eller Emil i skolan, eller skickar ett mail till davan839. Det enda som r&auml;knas i slut&auml;ndan &auml;r huruvida du har bidragit eller ej. Sj&auml;lvklart &auml;r alla v&auml;lkomna att ta del av materialet och f&ouml;lja experimentet.<br /></p><p>Det h&auml;r ska bli mycket intressant. Utan att ljuga ser jag faktiskt fram emot en h&auml;rlig kurs <strong>TSDT77 Digital kommunikation.</strong></p><h3>Addendum</h3><p>Per upplyste mig om att Oskar (&Aring;kerlund) b&ouml;rjade med tentafr&aring;gssammanfattning p&aring; <em>Image-Based Rendering</em>-kursen i &aring;r. Tack, Per!&nbsp;</p>		</div>
		<div id="signatur">
						<a href="/forfattare/2"><img src="/bilder/forfattarbilder/2.jpg" alt="Herr Ambassadör David Andersson"/></a>
						<p style="padding-top: 60px;">
				<a href="/forfattare/2">Herr Ambassadör David Andersson</a><br/>
				Publicerad 14 mars 2006, uppdaterad 15 mars 2006			</p>
			<div class="clear"></div>
		</div>
	</div>
</div>
					<div style="clear: both;"></div>
				</div>
				<div id="sidfot">
					<p>Copyright &copy; 2005 <a href="/forfattare">Anders Fjeldstad et al.</a></p>
				</div>
			</div>
			<div id="box_nere"></div>
		</div>
		<script src="http://www.google-analytics.com/urchin.js" type="text/javascript"></script>
		<script type="text/javascript">
			_uacct = "UA-342048-1";
			urchinTracker();
		</script>
	</body>
</html>
