---
title: Skogen, min nya nemesis och älskarinna
permalink: /artikel/360
---

<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" xml:lang="sv" lang="sv">
	<head>
		<title>Fjeldstad.se - En hel massa artiklar, helt enkelt</title>
		<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1"/>
		<meta name="author" content="Anders Fjeldstad et al."/>
		<link rel="stylesheet" href="/fjeldstad.css" type="text/css"/>
		<link rel="shortcut icon" href="/bilder/favicon.ico" type="image/favicon"/>
		<script type="text/javascript" src="/fjeldstad.js"></script>
			</head>
	<body>
		<div id="box">
			<div id="box_uppe"></div>
			<div id="box_mitten">
				<div id="navigering">
					<!-- Det a-element som är aktivt ska ha id 'navigering_aktiv' -->
					<a  href="/start"><img src="/bilder/design/start_inaktiv.jpg" alt="Start"/></a>
					<a href="/artikelarkiv"><img src="/bilder/design/artikelarkiv_inaktiv.jpg" alt="Artikelarkiv"/></a>
					<a href="/forfattare"><img src="/bilder/design/forfattare_inaktiv.jpg" alt="Författare"/></a>
					<a href="/om"><img src="/bilder/design/omfjeldstadse_inaktiv.jpg" alt="Om Fjeldstad.se"/></a>
					<a href="/kontakt"><img src="/bilder/design/kontakt_inaktiv.jpg" alt="Kontakt"/></a>
					<a href="/skriv"><img src="/bilder/design/skriv_inaktiv.jpg" alt="Skriv!"/></a>
				</div>
				<div id="arbetsyta">
					<div id="vansterspalt">
		<div id="artikel-bilder">
		<img src="http://gamla.fjeldstad.se/dropshadow.php?image=bilder/titelbilder/360.jpg" alt="Skogen, min nya nemesis och älskarinna"/>
	</div>
	
	
	
		<h3>Läsarnas kommentarer</h3>
	<ul id="kommentarlista">
				<li><span>1. Dejan <span>23 juli 2006</span></span><div class="avdelare"></div><p>Super Nanny version flickv&auml;nspatrullen v&auml;ntar dig n&auml;r du kommer hem till Nkpg, Jonas. Vi ska styra upp dem &aring;t dig! Synd att du inte fick medaljplats, det hade gynnat dig i flickv&auml;nsjakten. Vi l&ouml;ser det p&aring; annat s&auml;tt. Vi &auml;r civilingenj&ouml;rer, vi kan det h&auml;r.</p></li>
				<li><span>2. Anders <span>24 juli 2006</span></span><div class="avdelare"></div><p>Underbar artikel, Jonas! H&aring;h&aring;. Dock: med ditt nya Majest&auml;tiska Rum i salongerna s&aring; kommer kvinnorna att flockas. Jag har sett det h&auml;nda. Det &auml;r inte f&ouml;rr&auml;n man sj&auml;lv kliver in som de f&ouml;rsvinner.</p></li>
				<li><span>3. Dejan <span>25 juli 2006</span></span><div class="avdelare"></div><p>Anders, som n&auml;r din fantastiska kvinna d&auml;ckar i din s&auml;ng?</p></li>
				<li><span>4. AzP <span>25 juli 2006</span></span><div class="avdelare"></div><p>&quot;N&auml;r jag s&aring;g dig t&auml;nkte jag 'Han &auml;r riktigt s&ouml;t'.. Sedan &ouml;ppnade du munnen&quot;</p></li>
				<li><span>5. AzP <span>25 juli 2006</span></span><div class="avdelare"></div><p>Bitterhet &auml;r en vacker dygd. Sj&auml;lv&ouml;mkan... hmm. Inte likas&aring;. Men grattis till f&ouml;rstaplatsen och flera fj&auml;rdeplatser! Fan det var ju bra ju.</p></li>
				<li><span>6. Kloonas <span>26 juli 2006</span></span><div class="avdelare"></div><p>Tack f&ouml;r uppmuntrande kommentarer. Men som sagt kan det bli lite f&ouml;r mycket sj&auml;lv&ouml;mkan ibland. Snart &auml;r man borta fr&aring;n den h&auml;r ensamma stan iallfall. Vi ses p&aring; l&ouml;rdag.</p></li>
			</ul>
	
	<h3>Skriv en kommentar</h3>
	<form action="/artikel/360" method="post">
		<div id="kommentarformular">
			
			<h6 class="mini"><label for="falt-namn">Ditt namn</label></h6>
			<input class="specialfalt" type="text" id="falt-namn" name="name" maxlength="30" value=""/>

			<h6 class="mini"><label for="falt-kommentar">Din kommentar</label></h6>
			<textarea id="falt-kommentar" name="comment" cols="30" rows="8"></textarea>

			<input class="botbane" style="float: right; margin-right: 5px;" type="submit" name="rensa" value="Rensa"/>
			<input class="knapp" style="float: right; margin-right: 7px;" type="submit" name="spara" value="Spara"/>
			<div class="clear"></div>
		</div>
	</form>

</div>
<div id="hogerspalt" style="margin-bottom: 0px;">
	<div id="artikel">
		<h1>Skogen, min nya nemesis och &auml;lskarinna</h1>
		<div class="ingress">
			<p>Jag har under senaste veckan upplevt n&aring;got av ett fenomen fr&aring;n min barndom. Det kallas O-ringen och &auml;r en 5 dagars t&auml;vlingen i den lite undanskymda familjesporten orientering. </p>		</div>
		<div>
			<p>Kort sagt g&aring;r det hela ut p&aring; att 15 000 m&auml;nniskor i &aring;ldrarna 9-90 uppdelas i ett hundratal klasser och skall under varje dag i fem dagar utmana skogen och f&ouml;rhoppningsvis hitta tillbaka. Ett flygf&auml;lt i s&ouml;dra h&auml;lsingland stod som samlingsplats f&ouml;r tusental t&auml;lt och husvagnar. Och gav en k&auml;nsla liknande Hultsfred men med fler tr&auml;ningsoverallskl&auml;dda barnfamiljer och f&auml;rre goter.</p><p>D&aring; jag levt sommaren isolerad, antingen framf&ouml;r datorn i min stekheta lilla etta eller i en solstol p&aring; den stora gr&auml;splanen utanf&ouml;r v&aring;r stuga, har jag sv&aring;rt att k&auml;nna mig komfortabel med andra m&auml;nniskor runt omkring mig... Sommaren har effektivt dragit ner den lilla attraktionskraft jag haft till noll genom d&aring;lig hygien, misslyckad klippning och r&auml;dsla f&ouml;r kl&auml;daff&auml;rer. Det &auml;r d&auml;rf&ouml;r frustrerande att se l&auml;ttkl&auml;dda v&auml;ltr&auml;nade orientererskor gassa i solen &ouml;verallt n&auml;r man vet att man aldrig kommer n&auml;ra n&aring;gon, n&aring;gonsin. <br /><br />Tur nog slapp man campingen och tog tillflyckt i stugan under den lilla lediga tid som fanns. Jag och mina tv&aring; br&ouml;der st&auml;llde upp i klassen H21M (Herrar 21 motion) med 88 andra deltagare. En klass f&ouml;r oss som inte orienterat p&aring; 5+ &aring;r men &auml;nd&aring; uppr&auml;tth&aring;llit of&ouml;rsk&auml;mt god kondition. Vi hade alla tre spenderat veckan fr&auml;mst p&aring; solstolar vid stugan och 5 dagars (med en vilodag) l&ouml;pande &ouml;ver steniga hyggen k&auml;ndes lite avl&auml;gset. Men sammanfattningsvis f&ouml;rfl&ouml;t veckan s&aring;h&auml;r:<br /><strong><br />Dag 1 7,7 km</strong><br />Som ett pl&ouml;tsligt uppvaktande befinner man sig i skogen, yrvaken f&ouml;rsvinner stenar och &ouml;vrigt skogsmateriell under f&ouml;tterna... och man kan surt konstatera att kontrollen ligger 10 minuter &aring;t fel h&aring;ll, rej&auml;la skavs&aring;r b&ouml;rjar utvecklas p&aring; stort&aring;na och minst 6 km av banan &aring;terst&aring;r. Haltar in p&aring; en 19:e plats.<br /><strong><br />Dag 2 6,4 km</strong><br />Helt pl&ouml;tsligt har nyckelelementet med orienteringen f&ouml;rsvunnit, dvs letande i skogen,&nbsp; banan best&aring;r av stigar och slutar i en sorts sand&ouml;ken som suger upp den sista energin och livsgnistan man har. Tur nog b&ouml;rjar grisar flyga och jag passar samtidigt p&aring; att vinna etappen. Ingen direkt naturlig f&ouml;rklaring f&ouml;r allt detta men pris i form av en linneduk fr&aring;n hudiksvalls kommun. Lyckad utveckling av skavs&aring;r med framst&aring;ende prestationer p&aring; h&auml;len. <br /><strong><br />Dag 3 3,5 km</strong><br />Med f&ouml;tterna inlindade i n&aring;gra lager tejp klarar man att ta sig runt, men naturlagarna verkar r&aring;da idag och man f&aring;r dela en fj&auml;rde plats. Sk&ouml;nt att slippa vara i centrum.<br /><br /><strong>Dag 4 0,0 km</strong><br />Vila, Verklig vila. Med viss gl&auml;dje d&aring; min lilla b&auml;rbara dator dykt upp p&aring; posten, Nu har mitt antisociala n&ouml;rderi inte l&auml;ngre fysiska gr&auml;nser.<br /><br /><strong>Dag 5 7,3 km</strong><br />&Auml;ntligen f&aring;r man k&auml;nna det som verkligen &auml;r orientering. Dvs chansartad l&ouml;pning genom myrmark, hyggen och andra milj&ouml;er som st&auml;ndigt f&ouml;rs&ouml;ker riva s&ouml;nder n&aring;gonting. Kvalar in p&aring; en total 4:e plats och b&ouml;rjar k&auml;nna en sorts f&ouml;rhoppning, kan en total medaljplats vara inom r&auml;ckh&aring;ll? Men samtidigt vet jag att jag inte &auml;r en m&auml;nniska som lyckas. <br /><br /><strong>Dag 6 6,5 km</strong><br />En l&aring;ngvarig miss och en tappad kontaktlins borde vara det som s&auml;nker mina f&ouml;rhoppningar. Men jag sl&aring;r in v&auml;lriktad diskvalifisering p&aring; mig sj&auml;lv genom valet att helt enkelt springa f&ouml;rbi en kontroll. Med grusade f&ouml;rhoppningar och skammen h&auml;ngande runt halsen k&auml;nns allting som normalt igen. Jag menar; hur realistiskt &auml;r det att en antisocial t&ouml;nt f&aring;r medalj. Hoppas den gick till en mer passande kandidat.</p><p>&nbsp;</p><p>N&auml;r man nu &auml;r tillbaka i sin l&auml;genhet finns det en k&auml;nsla kvar, och det&nbsp; &auml;r inte sm&auml;rtan fr&aring;n mina sargade h&auml;lar. Det &auml;r en l&auml;ngtan, en l&auml;ngtan tillbaka till tystnaden i skogen och gl&auml;djen n&auml;r man ser den orange/vita kontrollpunkten... eller s&aring; beh&ouml;ver jag verkligen en flickv&auml;n.<br /></p>		</div>
		<div id="signatur">
						<a href="/forfattare/6"><img src="/bilder/forfattarbilder/6.jpg" alt="Jonas Nilsson"/></a>
						<p style="padding-top: 60px;">
				<a href="/forfattare/6">Jonas Nilsson</a><br/>
				Publicerad 23 juli 2006			</p>
			<div class="clear"></div>
		</div>
	</div>
</div>
					<div style="clear: both;"></div>
				</div>
				<div id="sidfot">
					<p>Copyright &copy; 2005 <a href="/forfattare">Anders Fjeldstad et al.</a></p>
				</div>
			</div>
			<div id="box_nere"></div>
		</div>
		<script src="http://www.google-analytics.com/urchin.js" type="text/javascript"></script>
		<script type="text/javascript">
			_uacct = "UA-342048-1";
			urchinTracker();
		</script>
	</body>
</html>
