---
title: Fortum från helvetet
permalink: /artikel/372
---

<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd"><html xmlns="http://www.w3.org/1999/xhtml" xml:lang="sv" lang="sv">
	<head>
		<title>Fjeldstad.se - En hel massa artiklar, helt enkelt</title>
		<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1"/>
		<meta name="author" content="Anders Fjeldstad et al."/>
		<link rel="stylesheet" href="/fjeldstad.css" type="text/css"/>
		<link rel="shortcut icon" href="/bilder/favicon.ico" type="image/favicon"/>
		<script type="text/javascript" src="/fjeldstad.js"></script>
			</head>
	<body>
		<div id="box">
			<div id="box_uppe"></div>
			<div id="box_mitten">
				<div id="navigering">
					<!-- Det a-element som är aktivt ska ha id 'navigering_aktiv' -->
					<a  href="/start"><img src="/bilder/design/start_inaktiv.jpg" alt="Start"/></a>
					<a href="/artikelarkiv"><img src="/bilder/design/artikelarkiv_inaktiv.jpg" alt="Artikelarkiv"/></a>
					<a href="/forfattare"><img src="/bilder/design/forfattare_inaktiv.jpg" alt="Författare"/></a>
					<a href="/om"><img src="/bilder/design/omfjeldstadse_inaktiv.jpg" alt="Om Fjeldstad.se"/></a>
					<a href="/kontakt"><img src="/bilder/design/kontakt_inaktiv.jpg" alt="Kontakt"/></a>
					<a href="/skriv"><img src="/bilder/design/skriv_inaktiv.jpg" alt="Skriv!"/></a>
				</div>
				<div id="arbetsyta">
					<div id="vansterspalt">
		<div id="artikel-bilder">
		<img src="http://gamla.fjeldstad.se/dropshadow.php?image=bilder/titelbilder/372.jpg" alt="Fortum från helvetet"/>
	</div>
	
		<h3>Externa länkar</h3>
	<ul>
				<li><a href="http://www.fortum.se" title="Fortum">Fortum</a></li>
				<li><a href="http://www.konsumentverket.se" title="Konsumentverket">Konsumentverket</a></li>
			</ul>
	
	
		<h3>Läsarnas kommentarer</h3>
	<ul id="kommentarlista">
				<li><span>1. AzP <span>5 februari 2007</span></span><div class="avdelare"></div><p>Det suger och jag hatar dem. Jag k&auml;nner samma sak, trots att jag f&ouml;rhoppningsvis inte beh&ouml;ver betala dubbelt s&aring; pass l&auml;nge. Men det &auml;r underbart med 990 kr till Fortum nu i Januari, och samtidigt 550 kr till GodEl f&ouml;r &quot;f&ouml;rflyttningspris&quot; och startavgift och hela skiten. J&auml;vla helvetes elf&ouml;retag. Vad sade du? Gick fortum &lt;u&gt;plus&lt;/u&gt; 1 470 miljoner Euro f&ouml;rra &aring;ret sade du?</p></li>
				<li><span>2. AzP <span>5 februari 2007</span></span><div class="avdelare"></div><p>Konsumentverkets tips p&aring; sidan som du l&auml;nkar till:
&quot;Vilhelms tips:

    * G&ouml;r ett aktivt val. Annars f&aring;r du tillsvidarepris, som ofta &auml;r dyrast.&quot;</p></li>
			</ul>
	
	<h3>Skriv en kommentar</h3>
	<form action="/artikel/372" method="post">
		<div id="kommentarformular">
			
			<h6 class="mini"><label for="falt-namn">Ditt namn</label></h6>
			<input class="specialfalt" type="text" id="falt-namn" name="name" maxlength="30" value=""/>

			<h6 class="mini"><label for="falt-kommentar">Din kommentar</label></h6>
			<textarea id="falt-kommentar" name="comment" cols="30" rows="8"></textarea>

			<input class="botbane" style="float: right; margin-right: 5px;" type="submit" name="rensa" value="Rensa"/>
			<input class="knapp" style="float: right; margin-right: 7px;" type="submit" name="spara" value="Spara"/>
			<div class="clear"></div>
		</div>
	</form>

</div>
<div id="hogerspalt" style="margin-bottom: 0px;">
	<div id="artikel">
		<h1>Fortum fr&aring;n helvetet</h1>
		<div class="ingress">
			<p>N&auml;r vi i dagarna fick elr&auml;kningen f&ouml;r december m&aring;nad s&aring; tyckte vi att det s&aring;g ut att vara j&auml;vligt dyrt, 831 kr totalt. Vi kollade upp specifikationen r&auml;tt noga och j&auml;mf&ouml;rde med Konsumentverkets prisguide &ouml;ver elleverant&ouml;rer. Resultatet blev f&ouml;rargande och frustrerande...<br /></p>		</div>
		<div>
			<p>N&auml;r vi flyttade hit till Stockholm i augusti s&aring; fick vi veta att Fortum f&ouml;r n&auml;rvarande var leverant&ouml;r av s&aring;v&auml;l el och eln&auml;t. Efter ett par veckor ringde en s&auml;ljare fr&aring;n Fortum upp och fr&aring;gade om vi var intresserade av ett elabonnemang med bundet pris. Jag svarade att vi i dagsl&auml;get inte ville binda n&aring;gonting, varp&aring; s&auml;ljaren f&ouml;reslog att vi skulle v&auml;lja alternativet Fortum Enkel som skulle vara ett bra abonnemang att ha tills vidare om man inte ville binda. Jag tyckte att det l&auml;t rimligt.</p><p>Om man g&aring;r in p&aring; <a href="http://www.fortum.se/document.asp?path=19923;22344;22353;23972;23973;23978;23981;23986;23987&amp;level=4" target="_self">Fortums webbsida</a> och l&auml;ser om Fortum Enkel s&aring; st&aring;r det att avtalet avser ett r&ouml;rligt pris som varierar med en m&aring;nad i taget. Det st&aring;r ocks&aring; att man automatiskt garanteras el som &auml;r milj&ouml;m&auml;rkt. S&aring; mycket mer st&aring;r inte. Det verkar v&auml;l bra?</p><p>Konstigt bara att avtalet inte finns med i <a href="http://www.elpriser.konsumentverket.se/" target="_self">Konsumentverkets prisguide &ouml;ver elleverant&ouml;rer</a>. Vi antog att det motsvarades av Fortums r&ouml;rliga pris, men blev d&aring; f&ouml;rv&aring;nade &ouml;ver att den f&ouml;rv&auml;ntade &aring;rskostnaden i Konsumentverkets tabell var n&auml;stan h&auml;lften s&aring; h&ouml;g som den p&aring; v&aring;r faktura.</p><p>Jag ringde upp Fortums kundtj&auml;nst och m&ouml;ttes d&aring; av en medarbetare som var mycket f&ouml;rv&aring;nad att vi &quot;fortfarande hade Fortum Enkel&quot;. Detta &auml;r ju ett tills-vidare-abonnemang som man bara har innan man har gjort ett aktivt val, fick jag veta. Priset per kilowattimme f&ouml;r Fortum Enkel &auml;r ungef&auml;r dubbelt s&aring; h&ouml;gt som det aktuella r&ouml;rliga priset, fick jag ocks&aring; l&auml;ra mig.</p><p><strong>Reflektion:</strong> Det &auml;r ju sm&aring;tt f&ouml;rj&auml;vligt att en s&auml;ljare kan rekommendera ett abonnemang som samma f&ouml;retags kundtj&auml;nst i princip skrattar &aring;t. Jag blir riktigt f&ouml;rbannad n&auml;r jag t&auml;nker p&aring; att vi betalat alldeles f&ouml;r mycket i n&auml;stan ett halv&aring;r nu, och att det i slut&auml;ndan &auml;r jag som ser dum ut. Det mest frustrerande &auml;r att det &auml;r s&aring; l&auml;nge sedan att jag naturligtvis inte kommer ih&aring;g vad s&auml;ljaren hette, s&aring; det ger liksom inget att ringa och klaga. Kundtj&auml;nsttjejen sa bara ungef&auml;r att &quot;det &auml;r ju bra att du byter till r&ouml;rligt nu i alla fall&quot;.</p><p>Fan fan fan.&nbsp;</p>		</div>
		<div id="signatur">
						<a href="/forfattare/1"><img src="/bilder/forfattarbilder/1.jpg" alt="Anders Fjeldstad"/></a>
						<p style="padding-top: 60px;">
				<a href="/forfattare/1">Anders Fjeldstad</a><br/>
				Publicerad 10 januari 2007			</p>
			<div class="clear"></div>
		</div>
	</div>
</div>
					<div style="clear: both;"></div>
				</div>
				<div id="sidfot">
					<p>Copyright &copy; 2005 <a href="/forfattare">Anders Fjeldstad et al.</a></p>
				</div>
			</div>
			<div id="box_nere"></div>
		</div>
		<script src="http://www.google-analytics.com/urchin.js" type="text/javascript"></script>
		<script type="text/javascript">
			_uacct = "UA-342048-1";
			urchinTracker();
		</script>
	</body>
</html>
